{
  "updated_at": "2026-01-03T12:15:26.722Z",
  "count": 6,
  "writings": [
    {
      "id": "ad66b998-a998-437c-b660-b20b78fa72ea",
      "title": "My Unconventional Career Path",
      "category": "Published",
      "created_at": "2026-01-02T23:03:48.837091+00:00",
      "updated_at": "2026-01-02T23:04:07.847257+00:00",
      "content_markdown": "# My Unconventional Career Path\n\nso since some people are asking for details, here's long version how i did my unconventional career path\n\n───────────────────────────────────────\n\nAge 14 - I was rotting in school\n\nnot much STEM programs or competitions. just memorizing stuff I didn't care about\n\nand I stumble on this hack: you can take university entrance exams (IGCSE) without going to an international school & at any age (not sure about the age actually)\n\nso I'm like... wait what? let's try it\n\n───────────────────────────────────────\n\nthe constraints were brutal:\n\nI registered immediately, but only had 4-6 months to learn 2 years of material. everything in English (had to relearn all the terms). RM500+ per exam. family couldn't afford tutors. still had to go to regular school during the day\n\nso I just... studied on my own at night\n\n───────────────────────────────────────\n\nmy \"education system\":\n\nKhan Academy + borrowed textbooks + random YouTube videos\n\nzero teachers. zero mentors. just curiosity and internet access\n\nfunny how the best education I got was free and available to anyone\n\n───────────────────────────────────────\n\nresults? barely passed.\n\nbut here's the thing - I learned more in those 4-6 months than I did in years of traditional school\n\nbecause I chose to learn. didn't feel forced. actually enjoyed reading the textbook every night\n\nthat's the unlock right there\n\n───────────────────────────────────────\n\nAge 15-16 - started uni in mechanical engineering\n\nhated it. way too theoretical\n\nso I taught myself to code, built an app, switched to computer engineering\n\nthe lesson? don't be precious about your path. pivot fast\n\n───────────────────────────────────────\n\nAge 17 - got my first internship as a software engineer\n\nstarted freelancing on the side\n\nand I learned something important: companies don't care how old you are. they care if you can ship\n\ncan you ship? cool, you're hired\n\n───────────────────────────────────────\n\nAge 18 - started a tech club. gave workshops. won hackathons\n\nwhy? because I was terrified of public speaking\n\nand I figured the best way to get over a fear is to just do it over and over until it's not scary anymore\n\nworked pretty well tbh\n\n───────────────────────────────────────\n\nAge 19 - started an AI blog\n\nthat blog led to my second internship as an AI engineer and then this crazy opportunity to co-author a paper with MIT\n\nstill in uni doing all my assignments\n\n───────────────────────────────────────\n\nhow? I just said no to everything that didn't matter\n\nno partying. no random clubs. just focus on the stuff that compounds\n\none blog post can lead to infinite opportunities. that's leverage\n\n───────────────────────────────────────\n\nAge 20 - graduated with awards, gave the valedictorian speech\n\neveryone's like \"wow you're so smart\"\n\nbut they didn't see me falling asleep on textbooks every night at 14\n\nit wasn't intelligence. it was just reps\n\n───────────────────────────────────────\n\nAge 21-22 - started an AI consulting biz\n\nfreelanced while traveling\n\nmost clients came from people reading my blog\n\nwild how that works - you write online, strangers trust you, they hire you\n\ninternet arbitrage is insane\n\n───────────────────────────────────────\n\nAge 23 - joined a VC-backed startup as cofounder/CTO\n\nhit $5K MRR and 20K users 6 months after launch\n\nalso did hackathons, talks, TV, podcast, grew TikTok to 10K\n\neverything just started compounding at once\n\n───────────────────────────────────────\n\nhere's what I'd tell my younger self:\n\nstart before you're ready. learn because you want to, not because you have to. say no to almost everything. build stuff people want. write online consistently\n\nthat's basically it\n\n───────────────────────────────────────\n\nnot gonna lie, I got lucky in a bunch of ways\n\nbut mostly I just started early and kept going\n\nif you're thinking \"I should do X\" - just start today. don't wait for perfect conditions\n\nthey're never coming"
    },
    {
      "id": "c8260c7a-6f9b-4543-9595-9ff2f4f20c0f",
      "title": "Toastmaster Speech Structure",
      "category": "Published",
      "created_at": "2026-01-02T22:50:29.426144+00:00",
      "updated_at": "2026-01-02T22:50:59.219786+00:00",
      "content_markdown": "# Toastmaster Speech Structure\n\n## OREO\n\n- Opinion, Reason, Examples, Opinion\n- Bonus: Add CTA at the end\n- Simple agreeing or disagreeing with a point\n\n## Pendulum\n\n- Opinion with arguments of both sides\n- Side 1, Explain, Side 2, Explain, Opinion\n\n## Balance\n\n- Being neutral/give alternative opinion from both sides\n- Side 1, Explain, Side 2, Explain, Neutral/completely new opinion\n\n## Problem/Solution\n\n- Problem, Cause, Solution\n\n## Timeline\n\n- Past, Present, Future, Conclusion\n\n## Zoom (Micro/Macro)\n\n- Offer perspective in different scale\n- perspective 1, perspective 2, perspective 3, conclusion/CTA\n- Perspective should vary in scale,\n- e.g (personal, family, work) or (home, organization, world)\n\n## Triangle Method\n\n- Offer different perspective\n- perspective 1, perspective 2, perspective 3, conclusion/CTA\n- E.g perspective as a parent, a wife, and a worker"
    },
    {
      "id": "c2d319b4-a1e0-4a83-8e79-cd7b20352372",
      "title": "What Differentiate Bragging and Inspiring",
      "category": "Published",
      "created_at": "2026-01-02T22:48:28.852795+00:00",
      "updated_at": "2026-01-02T22:50:10.145113+00:00",
      "content_markdown": "# What Differentiate Bragging and Inspiring\n\nI went to Instagram and saw a post by [redacted]. he bought a Tesla. I'm not sure how I feel. Envy? I thought for a second that I'll promise that I'll not be showing off my Tesla in the future. But could I do that? Was it so wrong to show off the Tesla? It's promoting EV after all. But at the same time, Tesla is RM200k, it's excessive luxury.\n\nThis is something I should ask myself.\n\nDo I want to be someone that display their wealth? At what condition can I display my wealth. Or display anything at all like virtues, piousness, etc?\n\nPros:\n\nCredibility, status = better treatment, inspiring\n\nCons:\n\nRia, incite envy, making people compare\n\nI don't want to make people envious, I want to make people inspired. How do I do that? How to show off to inspire? What separates them?\n\nDo I want to be known and respected for their wealthiness? No, I want to be known more by my virtues and knowledge. Does that mean it's okay for me to show off virtues and knowledge but not wealth?\n\nOr maybe I should just separate my showing off for status and my showing off for inspiration. Like the article about separating fuzzy and utilons in donation. Personal instagram for stroking my ego, and other platform to inspire and add value?\n\nBefore I post something ask myself, why?\n\nSome rules,\n\n- Don't share purchase or wealth unless it's review or it adds value\n\n- You can share if you want to normalize something (donation, running)\n\n- Share if it's inspiring (refer to my own experience, what kind of content have inspired, what kind have made me envious). What makes it inspiring if it includes the process and make people believe that they can do that, not that I can only do it because it's me\n\n- Refer Storyworthy? Stories worth sharing are the ones that reflect changes?\n\n- Share something if it add value to someone life (info)"
    },
    {
      "id": "0159251c-388e-49ef-8517-51aa8deae993",
      "title": "Keys to Success are Growth Mindset & Bias for Action",
      "category": "Published",
      "created_at": "2026-01-02T22:47:28.081405+00:00",
      "updated_at": "2026-01-02T22:48:18.987396+00:00",
      "content_markdown": "# Keys to Success are Growth Mindset & Bias for Action\n\n![image.png](https://hkqfndytgnnwadrfsfvp.supabase.co/storage/v1/object/public/photo-clips/3e2fbeab-0ea3-4e9c-a770-1db820e457e0/1767394075544_x609prbsp.png)\n\nAchieving any goal is comprised of two things: \n\n- The information gathering/planning\n\n- Actually doing the work. \n\nHumans already have the motivation for self-improvement by nature (self-determination), but growth mindset allow them to improve in any areas, including the knowledge of how to achieve success, and and set goals to improve on these other critical factors for success (e.g time management, leadership, communication, financial literacy, etc.).\n\nHowever, setting goals and planning would achieve nothing if there is no action. This is why bias for action and actually doing the work is important.\n\nThe second most important after growth mindset and bias for action is grit. Growth Mindset and Bias for Action complete the iterative loop for improvement. Grit is the speed of iterating this loop and how often you repeat the process. It gives the drive to keep improving (planning & executing) and the resilience to keep trying (repeating the process).\n\nFor other things, refer to Sam Altman's Post on Key to Success"
    },
    {
      "id": "69467523-8f6d-411d-a654-867a0c2dbc99",
      "title": "Fake it till you make vs being amateur openly",
      "category": "Published",
      "created_at": "2026-01-02T22:45:44.938901+00:00",
      "updated_at": "2026-01-02T22:46:08.809245+00:00",
      "content_markdown": "# Fake it till you make vs being amateur openly\n\nThe strategy I often use so far is 'fake it till you make it'. I've avoided sharing opinions or thoughts publicly that could reveal my inexperience, and only stick with objective facts like technical blogs or credentials.\n\nAnd it worked really well for me honestly. I got many opportunities above what I thought I was capable of, MIT research, international clients, startup, etc.despite my age and lack of experience.\n\nBut this also prevented me from being authentic, slowed down my own learning, and from forming my own original thoughts & opinions.\n\nMy mistake was trying to use the 'fake it till you make it' strategy everywhere. Even on 'IG or Tiktok' sometimes. Leaving me with no place where I can be transparently amateur & get feedback and learn.\n\nIn summary, I think you should clearly define the place where you adopt the fake it till you make it strategy but also reserve some space where you can be transparently amateur.\n\nBeing authentic on IG and Tiktok where I get less business opportunity and authenticity is more valued makes more sense. While I'd still want to project image that I'm an expert when I'm doing business deals, interview, etc."
    },
    {
      "id": "f22c7246-9e5a-43cf-8805-ce5e892dae97",
      "title": "on social media ban and e-kyc",
      "category": "Published",
      "created_at": "2026-01-02T22:36:19.212841+00:00",
      "updated_at": "2026-01-02T22:44:39.417264+00:00",
      "content_markdown": "# on social media ban and e-kyc\n\n**in 14 days, 4 cases of school violence happened in malaysia**\n\n**the government's response?**\n\n**malaysia's considering:**\n\n- mandatory eKYC\n- raising age limits from 13 to 16\n- potentially banning smartphones for under-16s\n\n**here's why this might create more problems than it solves**\n\na thread 🧵\n\n---\n\ncontext: october 2-14, 2024 - four separate incidents of students being harmed at school [be more detail on the cases, stabbing, etc]\n\nthe pattern was horrifying. parents are terrified. the anger is justified.\n\nwhen kids are getting hurt, you want to DO something immediately. i understand that impulse\n\n---\n\nparents are backing these measures\n\nmany cite \"brain rot\" from endless scrolling, exposure to harmful content, radicalization\n\nthese are real concerns from real people watching their kids struggle\n\nthe desire to protect children is 100% legitimate\n\n---\n\nbut here's my worry:\n\nsomewhere between \"protect our children\" and actual policy implementation\n\nwe might be building something that doesn't solve the problem\n\nand creates new ones we didn't anticipate\n\n---\n\nthe theory: kids exposed to violent content online → radicalized → violence at schools\n\nthe proposed solution: verify everyone's identity with IC numbers\n\nmy question: does knowing someone's IC number stop radicalization?\n\n---\n\nit's not that age verification is a bad idea\n\nkids probably SHOULDN'T have unrestricted access to everything online\n\nthe question is: are we doing this in a way that's secure, effective, and doesn't create worse problems?\n\n---\n\nlet's talk about malaysia's data security reality:\n\ndecember 2024: 17 million ICs leaked to the dark web (still circulating) 72.5% of users have had personal data compromised multiple government sites and databases breached\n\nthis isn't ancient history, this is NOW\n\n---\n\nso when we talk about giving dozens of platforms access to IC data\n\nit's not paranoia to ask: what happens when this leaks?\n\nbecause based on track record, it's not IF, it's WHEN\n\n---\n\nand here's the thing about surveillance infrastructure:\n\nyou might trust the current government to only use it for child safety\n\nbut what about the next government? or the one after that?\n\nonce you build the tool, you can't control who uses it or how\n\n---\n\nwe've seen this pattern across asia:\n\nthailand: started with \"protect the monarchy\" → now arresting students for tweets china: started with \"financial compliance\" → now full social credit system myanmar: started with \"national security\" → 1,840+ arrests for online posts\n\nall started with legitimate concerns\n\n---\n\nmalaysia already ran this experiment with SIM card registration\n\ngoal: reduce scams and crime seemed reasonable, right?\n\nresult: scam losses UP 29%, scam calls UP 82%, created \"SIM mule\" black markets\n\nbut government got a database linking every number to an IC\n\n---\n\ni'm not saying the government is evil or had bad intentions\n\ni'm saying the solution didn't work for its stated purpose\n\nbut it DID create infrastructure that could be used for other things\n\n---\n\nlet's talk about raising the age limit from 13 to 16:\n\ni get it - kids glued to screens, missing real-world development, exposure to harmful content\n\nmany parents support this\n\nbut have we thought through the implications?\n\n---\n\nwhat 13-16 year olds can actually do on social media:\n\n• follow educational content creators on YouTube/TikTok • join study groups and learning communities on Discord • access coding tutorials and tech communities on Reddit/Twitter • find mental health support and resources • connect with mentors and professionals in fields they're interested in\n\n---\n\nwhile kids in Singapore, South Korea, Japan are:\n\nbuilding online portfolios at 14 accessing global educational communities at 15 learning from international experts creating content that opens doors\n\nmalaysian kids would be... locked out until 16?\n\n---\n\ncutting kids off from social media isn't just protection\n\nit's limiting their access to the same opportunities that changed my life\n\nto free education, global communities, mentors who actually care, opportunities that don't care about your background\n\nthat's not protection, that's putting them behind\n\n---\n\nthis isn't just about safety\n\nit's about opportunity and competitiveness\n\na 17-year-old malaysian student can't join tech Twitter to learn from developers\n\nbut a 14-year-old in Singapore can network with startup founders and engineers\n\nwho's more prepared for the future economy?\n\n---\n\nand here's the practical reality:\n\nblanket bans don't work because determined kids find workarounds\n\nVPNs, borrowed accounts, fake ICs, older siblings' phones\n\nnow they're accessing content WITHOUT parental oversight or platform accountability\n\nyou've pushed the problem underground where it's harder to monitor\n\n---\n\n**so what WOULD actually work?**\n\nhere's the thing: we don't need to wait for perfect tech solutions\n\nthere are things we can do RIGHT NOW that actually work\n\n---\n\n**1. fix what we have FIRST**\n\nbefore collecting MORE data, secure what already exists\n\nenforce PDPA with real penalties - not slap-on-wrist fines mandate instant breach notifications upgrade government cybersecurity\n\ndon't build on a broken foundation\n\n---\n\n**2. regulate platforms, not people**\n\nlook at the EU Digital Services Act\n\nrequire algorithm transparency force platforms to audit their recommendation systems remove manipulative features like rage-bait amplification hold THEM accountable for harm, not us for existing\n\n---\n\nshoutout to @altorithm by @mypocketofpink who are doing crucial research on how algorithms shape experiences and amplify harm\n\nthis is the kind of work that should inform policy, not reactive surveillance\n\ncheck them out: pocketofpink.com/#/altorithm\n\n---\n\n**3. actually invest in education**\n\ndigital literacy reduces cyberbullying and scams by 72%\n\nSEVENTY TWO PERCENT\n\nmake media literacy core curriculum teach kids to spot manipulation and scams train teachers and parents\n\neducation beats surveillance every single time\n\n---\n\n**4. strengthen school environments**\n\nthose four incidents happened AT SCHOOL\n\nmental health support, conflict resolution, early intervention programs\n\nbuilding trust so kids report problems before they escalate\n\n---\n\n**5. THEN consider privacy-preserving tech**\n\nzero-knowledge proofs (ZKP) for age verification could work\n\nplatform sees \"this user is 16+\" without getting IC, name, address, or any personal data\n\n---\n\nBUT ZKP takes time to implement properly\n\ntransparent audits, independent oversight, corruption-resistant systems\n\ndon't rush this part just to look like you're doing something\n\ndo the other stuff FIRST while building this right\n\n---\n\n**here's the clear alternative path:**\n\n✓ platform accountability for algorithmic harms ✓ investment in digital literacy and mental health\n✓ fix existing data security infrastructure ✓ smart regulation that protects without handicapping\n\nTHEN when infrastructure is ready: ✓ ZKP-based verification with independent oversight\n\n---\n\n**here's my actual take:**\n\nage verification for social media? reasonable\n\nprotecting kids from harmful content? absolutely necessary\n\nparents' concerns? 100% valid\n\nthe method matters though\n\n---\n\ntraditional eKYC with IC numbers collected by dozens of platforms?\n\nthat's maximum risk for minimum benefit\n\none breach = millions compromised, and our track record suggests breaches are inevitable\n\n---\n\nblanket age restrictions for teens?\n\nsounds good until you realize you're handicapping our youth's competitiveness\n\nand pushing determined kids toward less supervised alternatives\n\n---\n\nZKP-based age verification with strong safeguards?\n\nthis could actually work\n\nprotects kids, preserves privacy, doesn't create surveillance infrastructure\n\nbut needs proper implementation and oversight\n\n---\n\nplatform regulation + digital literacy + school support?\n\nthis addresses ROOT CAUSES instead of just symptoms\n\nrequires sustained investment but actually prevents harm\n\n---\n\nwe CAN verify age without compromising privacy\n\nwe CAN protect children without handicapping their education\n\nwe CAN address radicalization without enabling authoritarianism\n\nit just requires doing it RIGHT instead of doing it FAST\n\n---\n\ni'm not anti-government here\n\ni genuinely believe they want to protect children\n\ni just think we need to pressure them toward solutions that work\n\nwithout creating bigger problems down the line\n\n---\n\nbecause once you build surveillance infrastructure, you can't unbuild it\n\nonce you compromise millions of ICs (again), you can't uncompromise them\n\nonce you lock kids out of educational resources, you can't uncomopete the disadvantage\n\n---\n\nlet's demand:\n\n• platform accountability for algorithmic harms • investment in digital literacy and mental health • ZKP-based verification with independent oversight • smart regulation that protects without handicapping\n\n---\n\nthis is solveable\n\nbut it requires asking the hard questions now\n\nnot after we've already built something we can't take back\n\n---\n\nif you care about this:\n\nshare this thread with parents, teachers, policymakers\n\nlet's have this conversation BEFORE policy becomes permanent\n\nour voices actually matter in shaping this\n\n---\n\nmalaysia's kids deserve protection from harm\n\nAND access to opportunity\n\nAND privacy\n\nwe don't have to choose\n\nwe just have to be smart about implementation\n\n---\n\nthe infrastructure we build today shapes the society we live in tomorrow\n\nlet's make sure we're building the right thing\n\nfor the right reasons\n\nin the right way\n\n/end 🧵"
    }
  ]
}