{
  "updated_at": "2026-02-01T10:38:23.651Z",
  "count": 56,
  "writings": [
    {
      "id": "f951da16-b4b6-4de9-9e9e-28705aa911e2",
      "title": "1/2 - Reading Empire of AI",
      "category": "notes",
      "created_at": "2026-02-01T05:20:43.787676+00:00",
      "updated_at": "2026-02-01T10:01:22.573056+00:00",
      "content_markdown": "# 1/2 - Reading Empire of AI"
    },
    {
      "id": "3625771b-4c39-4c69-864d-8eff95d826e7",
      "title": "Book Review: Stubborn Skill Grinder in a Timeloop",
      "category": "notes",
      "created_at": "2026-02-01T05:15:05.699916+00:00",
      "updated_at": "2026-02-01T05:20:02.91444+00:00",
      "content_markdown": "# Book Review: Stubborn Skill Grinder in a Timeloop\n\nRating: 4/5\n\nEnjoyed the series. It's a mix of my favorite genres: progressive fantasy, timeloop, and litrpg. It's also a fresh take on the timeloop genre. Whereas most MC will hide their timeloop abilities in fear of enemies finding workaround (soul/mind altering attack or torture and captivity) and people thinking they are crazy. This MC always openly share that he is in timeloop.\n\nThe main drawback is the MC is quite dumb and rely too much on the plot armor of his infinite willpower.\n\nOverall, if you liked Mother of Learning, i recommed this book."
    },
    {
      "id": "2662c2c8-64a8-469f-8aff-c820f78cdb05",
      "title": "Book Review: The Art and Business of Online Writing",
      "category": "notes",
      "created_at": "2026-02-01T05:10:13.566643+00:00",
      "updated_at": "2026-02-01T05:15:06.343363+00:00",
      "content_markdown": "# Book Review: The Art and Business of Online Writing\n\nRating: 4 star\n\nA great read on writing in short form for social media and how to capture attention.\n\nFull of concrete examples and easy actionables that people can take. \n\nThe author also manage to showcase his own skill. Enjoyed the pacing and the 'rate of revelation'.\n\nI was surprised of how he can write the book so long by just giving lots of concrete and specific examples, and going more in depth which reflects his own advice as well.\n\nAnd his advice is not just on the writing structure itself. But the business of online writing as well, e.g which platform to write, how to monetize it, the pieces of content to in funneling your readers, how some authors make their main income, etc."
    },
    {
      "id": "e9eed834-bc8a-4233-b0f8-231ef1ed10e5",
      "title": "Book Review: Utopia for Realist",
      "category": "notes",
      "created_at": "2026-02-01T04:56:31.806283+00:00",
      "updated_at": "2026-02-01T09:54:11.487242+00:00",
      "content_markdown": "Book Review: Utopia for Realist\n\nRating: 4.5/5\n\nReally enjoyed the book. Felt like cathartic release on what's wrong with the world. Or with capitalism. And then the book gave an idea of the future that we can hope or dream for.\n\nI think there are 5 main points from the book that I was intersting:\n\n• Less working hour • Universal basic income (UBI) • A better measurement of progress than GDP • Bullshit jobs • Open border\n\nI was quite skeptical with some ideas like open border, but the book arguments are surprisingly convincing and persuasive. It provides quite a lot of study, although I haven't fully verified the rigority of the source of study.\n\nI did feel the book is somewhat biased and there is lack of arguments thats' against the idea, and it's full of arguments/data that support the idea. Which makes me think of cherry picking and biased information.\n\nFor example, I wished the book discussed more on some concerns regarding UBI, e.g can we afford it? will this cause inflation? etc.\n\nBut it's great that the book does debunks some of the main myths: e.g the poor are poor becasuse they are lazy rather than the stress and shacke of poverty. People won't work when given handouts, etc.\n\nAnother thing I really liked was th final chapter actually addressed my concern in the book being biased. He talks about how we are prone to cognitive dissonances, and only finding information that agrees with our view and rejects or try to do mental gymanstic to justify the rest.\n\nHe talks about cognitive dissonate, and I found his thoughts on how ideas can change the world was insightful as well. On how humands are more prone to change to overwheming shock that counter their belief rather than a gradual convincing or reason. Which then makes me view the book is written purposely to be convincing and persuasive, rather than aiming for full accuracy and capturing all the nuances.\n\nThe last chapter elevated the book from 4 star to 4.5 or 5 star for me.\n\n---\n\n### Polished Version\n\n**Rating: 4.5/5**\n\nReading *Utopia for Realists* felt like a cathartic diagnosis of modern capitalism—validating the fatigue we feel and offering a structured dream for the future.\n\nRutger Bregman anchors his vision in five provocative pillars:\n\n- **A 15-hour work week**\n- **Universal Basic Income (UBI)**\n- **Replacing GDP with meaningful progress metrics**\n- **Eliminating \"bullshit jobs\"**\n- **Open borders**\n\nI was initially most skeptical about open borders, yet Bregman’s arguments were surprisingly persuasive. While the citations are plentiful, I admit I haven't fully vetted the rigor of every source. At times, the book feels like an exercise in confirmation bias; it advocates fiercely for its ideas without always steel-manning the counter-arguments—such as the inflationary risks or fiscal sustainability of UBI.\n\nHowever, the final chapter completely elevated the experience for me. Bregman steps back to address the very nature of belief and cognitive dissonance. He argues that history isn't changed by gradual reasoning, but by overwhelming shocks to the system that force us to adopt ideas previously deemed \"impossible.\"\n\nThis meta-commentary reframed the book for me: it isn't trying to be a neutral academic study, but rather a persuasive manifesto designed to stretch the window of political possibility. That self-awareness turned a 4-star read into a 4.5-star favorite."
    },
    {
      "id": "ac1ad4a9-c7c1-4ae9-b699-a897c7cb8cb7",
      "title": "On the Moltbook, AI social media trend",
      "category": "notes",
      "created_at": "2026-02-01T04:51:50.644607+00:00",
      "updated_at": "2026-02-01T04:56:31.705041+00:00",
      "content_markdown": "# On the Moltbook, AI social media trend\n\nI've been seeing bunch of social media posts hyping the Moltbook, which is a website where it's for AI agents only following the Moltbot or formerly Clawdbot trend.\n\nI think it's fairly annoying when the media or influencer somehow portrays oh the AI is so intelligent or it's so interesting that these AI talks about consciousness, etc. When most likely it's just prompted by the humans.  Or even the Moltbot itself, to act as if it's in social media, hence mimicking reddit post or social media behaviour.\n\nI think the most annoying part is the fact that most of supposedly AI post is probably prompted by human to be an engagement bait, just to be screenshotted and shared for engagement farming."
    },
    {
      "id": "3a0ab57b-78f5-462a-a652-58365cf4b0ec",
      "title": "31/1 - Reading and submitted brand content",
      "category": "notes",
      "created_at": "2026-02-01T03:56:44.614631+00:00",
      "updated_at": "2026-02-01T10:00:09.708612+00:00",
      "content_markdown": "# 31/1 - Reading and submitted brand content\n\nspent most of the day readingstubborn skill grider in timeloop book 2\n\ni also finished utopia realist and the art and business of online writing\n\nalso posted my peaches and cream videos and submitted the link"
    },
    {
      "id": "5a84f07a-790a-49e2-84cb-dbf4d5059be4",
      "title": "30/1 - Reading and applied to Mozilla Fellowship",
      "category": "notes",
      "created_at": "2026-02-01T03:53:55.345117+00:00",
      "updated_at": "2026-02-01T09:59:50.188894+00:00",
      "content_markdown": "# 30/1 - Reading and applied to Mozilla Fellowship\n\ni think i spent most of the day reading the book\n\nstubbon skill grinder in a timeloop\n\none productive thing i did is applying to mozilla fellowship"
    },
    {
      "id": "5a243fd5-8acf-42d3-9829-6a08f9cd6c68",
      "title": "29/1 - Hospital Review: UMSC - Stroke Treatment",
      "category": "notes",
      "created_at": "2026-01-29T15:01:23.829915+00:00",
      "updated_at": "2026-01-30T05:16:04.021624+00:00",
      "content_markdown": "# 29/1 - Hospital Review: UMSC - Stroke Treatment\n\n**Rating: 1/5**\n\nToday I went to the UM Specialist Centre (UMSC) for our third appointment for my dad's stroke with Dr. Tan Kay Sin. Overall our whole experience at UMSC is quite disappointing. We kept getting referred left and right to other doctors, while the doctors themselves questioned why they received the referral and why we came to them.\n\n**The Backstory: GH vs. UMSC** For context, we first went to GH when we suspected my dad's stroke. We did a CT scan which confirmed it. However, GH simply dismissed us, claiming nothing could be done. They prescribed medication with barely any explanation, and the next specialist appointment was set for 3 months later.\n\nSince that wait was too long, we went to UMSC based on a recommendation.\n\n**The Run-Around & Testing** We were first referred to Dr. Goh in the neurology department. Dr. Goh provided little consultation and candidly said, \"Well, stroke is not my expertise, you should go to Dr. Tan Kay Sin since he's the stroke expert.\" So we made an appointment to see him.\n\nAt our first appointment, we were told to do 4 tests: MRI scan, blood & urine test, ECG, and Echocardiogram.\n\nWe tried to do the MRI at UMSC but were told we had to wait 2 weeks. Which is ridiculous. This is not even a government hospital; it's semi-private. Refusing to wait, we made an appointment at Tung Shin Hospital for the day after tomorrow. We went in as walk-ins. They quoted RM4000 for 3 MRIs (Brain with contrast, MRA, and MRA neck). We managed to get it done by 2pm and received the result instantly. The radiologist graciously explained the results when we asked. We even received a discount, paying RM3500. Overall the Tung Shin experience was far superior to UMSC.\n\n**The \"Expert\" Consultation** A few days later, we returned to UMSC for the appointment with Dr. Tan Kay Sin and provided the MRI result.\n\nHe didn't even look at the scan; he merely read the summary report from the radiology file cover. That is something I can do—just ask ChatGPT to translate it for me. He noted narrowing around the eye (reiterating the summary's jargon) but claimed it wasn't clear, so we needed a Doppler eye test.\n\nIt makes us suspect if he even read the result honestly, or if the test was even necessary. It seems weird to suggest the MRI scan wouldn't show the narrowing around the eye (occipital lobe) clearly enough, requiring a Doppler test, WITHOUT HIM EVEN LOOKING AT THE MRI SCAN. but i may be wrong.\n\nTo make things funnier, on top of Dr. Tan, the hospital inexplicably referred us to Dr. Imran from Cardiology to explain the Echocardiogram and ECG results. But honestly, the result itself clearly stated it's okay. Even Dr. Imran didn't know why he received the referral and looked confused. IT'S ridiculous, because we still had to pay the consultation fee for the hospital's confusion which offered no benefit to us.\n\n**Today's Experience (3rd Appointment)** The filing and organization seem poor, and the fact that the nurse changes each time makes it worse.\n\n- **Scheduling Mess:** We came to get the result for the Transcranial Doppler test. The appointment was supposed to be yesterday, but for some reason, we were turned away and rescheduled to today.\n- **The Wait:** We arrived at 2pm. They couldn't even find the Doppler test result, forcing us to wait another hour.\n- **The Doctor's Memory:** When called, the doctor didn't even remember us, asking \"Where is the MRI test?\"—which we already did and shared with him during the last appointment.\n- **The Result:** After all that, the doctor essentially repeated his findings from the MRI scan result. Overall verdict: nothing to do except continue meds for blood thinner, blood pressure, cholesterol, diabetes, etc.\n\n**The Worst Parts**\n\n1. **Missing Crucial Care (Aphasia):** We explicitly told the doctor my dad had aphasia symptoms. Throughout 3 weeks of back-and-forth with UMSC, he made NO MENTION of getting therapy for his speech problem. I had to read online that speech therapy is crucial and best done early, as most improvement happens in the first month. The fact that the \"expert\" didn't even mention this felt negligent. To top it off, when we tried to make an appointment for the therapy, we were told we had to wait 4 months. Laughable.\n2. **Unsigned Results:** When we asked for the hard copy of the Doppler test result, we couldn't get it because he hadn't signed it yet. Which is ridiculous. We've been waiting a week since the test. The hospital was supposed to call today, yet we had to freaking go to the hospital and pick it up again.\n3. **The Audacity:** During the session, the Dr had the gall to ask, **\"Why do you come here actually?\"** Freaking ridiculous. This is our third appointment with him and he doesn't even remember. He kept complaining, \"why do we see so many doctors\" or \"why did this dr refer him\". It's clear my dad is having a stroke and HE is the stroke expert. All the referrals and passing between doctors are not by us anyway. IT'S BY THE FREAKING HOSPITAL.\n\nI felt like the hospital never admits any mistake or apologizes. It's clearly the hospital's confusion and repeated mistakes, but instead, they blame us or give excuses like \"why do we see so many doctors\" or \"why did this dr refer him\".,\"oh your file is missing\", \"oh the result has a mistake, I have to correct it first before signing.\"\n\n**Summary** After 3 weeks, 5 appointments, and probably RM5-7K later, I feel like we barely gained anything or any new insights. It was a lot of wasted consultations and tests. We didn't even get the crucial treatment needed for my dad (speech therapy for aphasia ASAP), just the basic preventative medicine.\n\nRating: 1/5. Avoid."
    },
    {
      "id": "6970f52d-0d30-48f6-9eba-da26433698ca",
      "title": "Movie review: Pompo The Cinephile",
      "category": "notes",
      "created_at": "2026-01-28T16:51:11.534778+00:00",
      "updated_at": "2026-01-28T17:08:33.283025+00:00",
      "content_markdown": "# Movie review: Pompo The Cinephile\n\nRating: 4.5/5\n\nSummary:\n\nA movie about a sincere hardworking assistant director and movie buff that finally get to direct his first movie and achieve his dreams.\n\nWhat I liked:\n\n- We have variety of interesting characters. \n\n  - The nepo baby who had privileged resources and background to make her into a child director prodigy but uses her privilege well by giving chances to the talented but less privileged characters.\n  - The passionate hardworking main character who was given a chance and proved his worth.\n  - The rags to riches actress\n  - The burnt out gifted kid (who helped MC raise fund)\n  - The supportive and humble successful actors\n- I love the theme of creating movie and how it portrays editing which makes this a unique movie\n- The theme is motivating and inspiring in general about achieving your dream and necessary sacrifice or effort you have to do\n- It kind inspired me to learn more on filmaking, e.g how certain scenes tell a story, which shot is best, etc\n\nWhat I disliked:\n\n- Unnecessary off-putting fan service at the start\n- The core message is not clear/impactful enough\n- I was hoping it would have actual good advices for filmmaking, but some of it are questionable, e.g\n\n  - You only need an attractive lead actress to make a good movie\n  - you need to be an outcast to be a director\n  - movie has to be short, 90 min long\n  - you need to sacrifice everything to make good art/movie\n\nWatched at 27/1/2026"
    },
    {
      "id": "bbd84a0c-243c-4624-adbf-45c825a05db4",
      "title": "Book Review: My Stroke of Insight",
      "category": "notes",
      "created_at": "2026-01-28T06:56:43.366081+00:00",
      "updated_at": "2026-01-28T07:28:35.332659+00:00",
      "content_markdown": "# Book Review: My Stroke of Insight\n\n**Rating: 3.5/5**\n\n### The Premise\n\nIt’s a rare and terrifying paradox: a neuroanatomist watching her own brain shut down. Dr. Jill Bolte Taylor’s *My Stroke of Insight* offers a first-person account of a massive stroke in the left hemisphere of her brain, stripping away her ability to process language, numbers, and ego, leaving her in a state of pure right-brain consciousness.\n\n### The Breakdown: Anatomy of a Stroke\n\nThe strongest part of this book is the visceral, almost clinical description of cognitive deterioration. Taylor chronicles the exact moment she realized she was having a stroke, followed by the terrifying struggle to perform basic tasks—like dialing a phone number—while her cognitive faculties (reading, speech, numerical processing) dissolved in real-time.\n\nFor anyone fascinated by the mechanics of the mind, this section is gripping. The vulnerability of living alone while losing the capacity to communicate or even understand one’s own existence is portrayed with haunting clarity.\n\n### The Recovery: Identity and Care\n\nBeyond the event itself, the book shines in its exploration of recovery. Taylor doesn't just discuss physical rehabilitation; she dives into the mental anguish of capacity loss—the feeling of being \"less than\" who you were before.\n\nShe offers valuable tactical advice for caregivers, emphasizing that recovery isn't just about medical intervention but about how patients are treated and engaged with. It’s a compassionate look at the patience required to rebuild a self from scratch.\n\n### The Critique: Science vs. Spirituality\n\nWhere the book lost me was in its second half. Taylor pivots heavily into spiritual language—describing \"being present\" through lenses of energy fields and \"cosmic connection.\" While I respect intuition, the terminology felt imprecise and occasionally distracted from the neurological grounding of her experience.\n\nFurthermore, the titular \"stroke of insight\"—that we can choose to step into a peaceful right-brain consciousness—felt slightly underwhelming. To me, this \"insight\" closely mirrors existing concepts of Stoicism or emotional regulation: the ability to observe thoughts without attachment and control one's perception. It’s a valid practice, but perhaps not the revolutionary revelation it’s framed as.\n\n### Verdict\n\n*My Stroke of Insight* is a fascinating case study of the brain from the inside out. While the spiritual conclusions may not land for everyone, the detailed account of the stroke and the empathetic guide to recovery make it a worthy read."
    },
    {
      "id": "bb93a4f9-5dc0-422a-bca3-0641a0dad0fc",
      "title": "27/1",
      "category": "notes",
      "created_at": "2026-01-27T11:27:37.715746+00:00",
      "updated_at": "2026-01-28T07:04:32.650032+00:00",
      "content_markdown": "# 27/1\n\nI spent almost the whole day since yesterday, playing Cut of the Lamb. It’s surprisingly short actually\n\none thing i liked is the run is only about 5-10 min compared to Hades 20-30min. But it’s not as fun as Hades gameplay\n\nThen I continued reading 'My stroke of insight\" book,  I'm planning to finish it eitehr today or tomorrow to fulfil my 2 books a month goal.\n\nAt night I watched Pompo the Cinephile, which is a pretty good/motivating movie about making a movie.\n\nAs for work, the productive thing I did was, setting up DNS for faw, and fixing some frontend bug"
    },
    {
      "id": "610ff15e-c94c-4bbc-8d1c-1615f4f8f43f",
      "title": "The Will of Many Book Review",
      "category": "notes",
      "created_at": "2026-01-25T20:17:05.564386+00:00",
      "updated_at": "2026-01-28T07:28:12.902446+00:00",
      "content_markdown": "# The Will of Many Book Review\n\nSummary:\n\n• A dystopian world with a roman like empire dominated. THe empire is based on a pyramid like / MLM like hierarchical psychic power. Where each person can cede 'will' to their upper rank. the upper rank will be physically more powerful to the 'will' the people under them supplied. and the higher ranked one will always be more powerful as they have more people under them and supplying 'will'\n\n• Underdog story of a fallen prince of an invaded country by an empire's tyranny, given up on revenge, but manipulated by the revolution army to be adopted by a senate, sent to be a double agent in a elite school meant for heirs.\n\nWhat I liked:\n\n• The pyramid hierarchical power system and how it's used to emphasize that inaction is also powering the oppressive system and may not be as innocent.\n• The tension pacing and how it kept me engaged throughout the book\n• the underdog / revolution trope\n\nWhat I disliked:\n\n• MC is goody two shoe\n• MC is too emotional / has temper issue.\n• How the unique 'Will' power system are not used much in the book (The academy practically ban the 'will' power)\n• Pacing of the revelation of the mystery. The mystery progress too slowly and the ending was not satisfying.\n\n- Ending is a bif of cliffhanger"
    },
    {
      "id": "5cb86c15-3111-4ae7-a5ba-426e2f74c2cb",
      "title": "Weekly Reviews",
      "category": "notes",
      "created_at": "2026-01-25T18:08:53.342242+00:00",
      "updated_at": "2026-01-26T13:19:55.447385+00:00",
      "content_markdown": "# Weekly Reviews\n\nI'll start doing weekly reviews for each year, so it's much easier to track on what I accomplished or any highlights when I do an annual review later.\n\n## Weekly Review 1:\n\n- New year at Genting\n\n- Personal Website and Annual reflection\n\nCleve\n- Working on Linkedin Wrapped\n- API system\n- Blog publishing\n- Local filesync\n\n## Weekly Review 2:\n\n• News about dad's stroke\n\nCleve\n\n-\n-\n-\n-\n\n## Weekly Review 3:\n\n-\n-\n-\n-\n\n## Weekly Review 4\n\n- Mobile app updates & bugfixes\n- Finishes The Will of Many book\n- Finished Hamilton movie"
    },
    {
      "id": "037c21d4-9a6c-4d08-bf3d-b12d936e2be4",
      "title": "January Review",
      "category": "notes",
      "created_at": "2026-01-25T18:05:04.386734+00:00",
      "updated_at": "2026-01-25T20:32:20.786895+00:00",
      "content_markdown": "# January Review\n\nbased on the weekly review, what can i imprve?\n\n- time blocking\n- weekly review\n- monthly goal\n- 80/20 rule (try one new thing per week)\n\nList of task I want to get done before end of January\n\n- [ ] Reply to Mole Interview\n- [ ] Schedule content calendar for February\n- [ ] Set goal for February\n- [ ] Apply to Mozilla Fellowship\n- [ ] Finish my personal website\n- [ ] Finish 2 book\n\n- [ ] The Will of Many\n- [ ] My stroke of insight\n\nCleve\n\n- [x] Saved post chrome extension\n- [x] Image generation\n- [x] Bi-directional links\n- [x] Publish page\n- [x] API integration\n- [x] Transcriber\n- [ ] Fixes Mobile App\n\n- [x] Chat history\n- [x] Writing migration\n- [ ] Rich text editor\n- [ ] Tool call\n- [ ] Robust search tool\n- [ ] Cleve MCP\n- [ ] Streak\n\nLogs:\n\nBooks:\n\n- Will of Many\n\nMovies:\n\n- Hamilton\n- Maze runner\n- Black bag?\n- Novocaine?"
    },
    {
      "id": "f829a89f-38d4-46ae-8290-1bccfad91609",
      "title": "How to overcome 80/20 rule",
      "category": "notes",
      "created_at": "2026-01-25T08:06:56.81283+00:00",
      "updated_at": "2026-01-25T08:06:56.81283+00:00",
      "content_markdown": "# How to overcome 80/20 rule\n\nI feel like my lack of progress for the past 2-3 years is because i often fall back to monotono routine, i put too much effort on things that havent bring significat return.\n\nI need to start trying more stuff that can give me exponential return rather than keep doing stuff that havent been giving me return\n\ni need to start being more proactive as well\n\ntwo things im gonna change:\nweekly review, to review which action is working and which arenot. mainly to discover the actions that havent worked and stop it\n\ntrying something new\nthis to encourage to try moree stuff rather than repeating things that doesnt work\n\nalso reminder to double down on things tht worked. or try new ways to scale it up"
    },
    {
      "id": "4f598c02-92cf-40ff-aff1-3d51fdd90561",
      "title": "25/1 - Finished Hamilton and work",
      "category": "notes",
      "created_at": "2026-01-25T07:57:08.262471+00:00",
      "updated_at": "2026-02-01T10:01:01.79919+00:00",
      "content_markdown": "# 25/1 - Finished Hamilton and work\n\nWhat I did today:\n\n• Chrome extension got accepted & published\n• Fixed Mobile app audio transcription\n• Requested refund ticket for RapidAPI $500 bill (forgot to unsubscribe)\n• Finished watching Hamilton\n• Tried Claude chrome\n\nOther:\n\nSent Ain for Tedx KYUEM, ate oatmeal"
    },
    {
      "id": "673f70f8-a37d-4a2a-93ba-b9c69046bbd7",
      "title": "24/1 - Work",
      "category": "notes",
      "created_at": "2026-01-24T12:45:45.439132+00:00",
      "updated_at": "2026-02-01T10:01:09.508535+00:00",
      "content_markdown": "# 24/1 - Work\n\nWhat I did today:\n\n- [x] Added image gen feature on mobile & web\n- [x] Fixed chat history on mobile\n- [x] Added extract content tool on mobile\n- [x] Watched maze runner"
    },
    {
      "id": "0652ddc8-4a60-4220-b88a-f800c6beeede",
      "title": "23/1 - Updated Cleve app",
      "category": "notes",
      "created_at": "2026-01-23T05:00:10.146299+00:00",
      "updated_at": "2026-01-25T05:02:43.418573+00:00",
      "content_markdown": "# 23/1 - Updated Cleve app\n\nThings I did today:\n\n• submitted Peach and Cream content video\n• Fixed and resubmitted Cleve extension.\n• Submitted android update\n\nI had issue previously where google sign in received DEVELOPER_ERROR in the android simulator. The problem was the SHA-1 certificate configuration. Even if you don't use the android oauth, and only the web client id. You still need to create the android client id and set the configuration properly.\n\nI'm pretty sure i fixed the issue previously by setting the SHA-1 certificate formt the google play console > releases > app integrity. Since Play store published app resign the sha-1.\n\nBut for some reason building locally give the same issue, while if I build from EAS cloud service, it works. I tried matching local credential to eas credential but doesn't seem to work either. But it might be because I didn't clear cache and rebuild the app with the new SHA-1.\n\nOverall i just fixed it by using eas to build."
    },
    {
      "id": "e3d83e90-c7ac-4bf1-96ce-0fa678ca7ca1",
      "title": "My dad medical history",
      "category": "notes",
      "created_at": "2026-01-22T04:09:56.567267+00:00",
      "updated_at": "2026-01-22T08:41:50.081766+00:00",
      "content_markdown": "# My dad medical history\n\nWriting medial history\n\nI am writing to inquire about a consultation with Dr. Erwin Joe regarding my father's post-stroke condition and potential treatment options for aphasia recovery.\n\nPatient Information:\n\n• Name: Redacted\n• Age: 66 years old\n• Gender: Male\n\nCurrent Condition: My father experienced an acute ischemic stroke approximately 1-2 weeks ago. His primary symptom is aphasia with difficulty in speech. Motor function remains intact.\n\nMedical History:\n\n• Type 2 Diabetes (HbA1c: 7.9%)\n• Hypertension (currently controlled with medication)\n\nTests Completed:\n\n• MRI Brain with contrast + MRA Brain + MRA Neck (16 Jan 2026, Tung Shin Hospital)\n• Blood test and urine test (15 Jan 2026, UMSC)\n• ECG (UMSC)\n• Echocardiogram (19 Jan 2026, UMSC)\n\nKey MRI/MRA Findings:\n\n• Acute left parieto-occipital lobe infarcts\n• Chronic lacunar infarcts in both lentiform nucleus with chronic small vessel disease\n• Mild narrowing at cavernous part of left ICA (atherosclerotic changes)\n\nEchocardiogram Summary:\n\n• LVEF: 66% (normal), Grade I diastolic dysfunction, no significant cardiac abnormalities\n\nCurrent Treatment: He is on medication for secondary stroke prevention (blood thinners, diabetes, cholesterol, and blood pressure management) prescribed by specialists at UM Specialist Centre.\n\nConsultation Request: We are seeking expert consultation on treatment options for aphasia recovery. Specifically, we would like to understand:\n\n• Whether thrombectomy or any interventional procedures are still viable given the timeframe\n• Available treatment options beyond speech therapy and preventive medication—such as methods to enhance neuroplasticity, neurostimulation therapies (e.g., TMS, tDCS), or other emerging approaches for aphasia recovery\n• Recommended rehabilitation protocol for his specific case\n\nPlease advise on:\n\n• Availability for consultation with Dr. Erwin\n• Any additional records or imaging needed (we can provide full reports)\n• Consultation fees and process\n• Whether teleconsultation is available for initial assessment\n\nThank you for your assistance."
    },
    {
      "id": "0e33a4f6-deaa-4e2b-8eeb-d390d8bdca96",
      "title": "Dopamine Detox",
      "category": "notes",
      "created_at": "2026-01-22T03:58:17.371492+00:00",
      "updated_at": "2026-01-22T04:09:44.560219+00:00",
      "content_markdown": "# Dopamine Detox\n\nI feel like I haven't been as productive recently, I suspect it's because I went back to the addictive dopamine overload cycle again. I'm constantlyy doomscrolling/play addictive roguelike games/read novels. If not, I'll be experiencing dopamine withdrawal symptom, where I constantly feel like i need to simulate myself with something. And actual work where it has delayed dopamine instead of instant dopamine is quite hard to start. Although usually once I was able to start and get into it for 5min or so, would have no problem to continue working. The difficult part is in starting.\n\nOnce in a while I will be stuck in that mode. The most productive I've been is the moment after I wake up. Sleep seems to reset my dopamine withdrawal.\n\nI need to figure out a way to regulate my emotion quickly when dopamine addiction happen as i mention in .\n\nHere is a proposed solution:\n\n- Cut down all instant dopamine activity:\n\n  - No Doomscrolling\n  - No games\n  - No novel (Reading non-fiction is still okay)\n- Music (to lessen dopamine widthrawal a bit)\n- watch inspiring video\n- review/write down my goals\n- Sleep\n- Or just think\n- Push up? or physical exercise"
    },
    {
      "id": "cca5d83a-2c3a-4aee-928e-a33ea66c2d2d",
      "title": "Cleve Authentication Bug and losing note",
      "category": "notes",
      "created_at": "2026-01-22T03:15:03.356752+00:00",
      "updated_at": "2026-01-25T02:17:28.380765+00:00",
      "content_markdown": "# Cleve Authentication Bug and losing note\n\nI just experienced the bug where I lost my long note. That was really frustrating. The thing is I'm not sure what was the issue. The trigger was the authentication i guess."
    },
    {
      "id": "142dab68-837c-4c31-a322-5c3bd4e8dbd3",
      "title": "Things to do:",
      "category": "notes",
      "created_at": "2026-01-21T08:36:04.405413+00:00",
      "updated_at": "2026-01-21T09:06:16.39783+00:00",
      "content_markdown": "# Things to do:\n\n- reply to cathertea/Mole\n- make peach and cream video\n- message to shiva and confirm kelas sekejap\n- resubmit chrome extension after confirming"
    },
    {
      "id": "f4cd903c-50d7-42df-bad2-aed1f7180b0e",
      "title": "21/1 - Tiny Bookshop Game Review - Book Recommendation Gameplay",
      "category": "notes",
      "created_at": "2026-01-21T08:26:34.91725+00:00",
      "updated_at": "2026-01-25T05:08:58.933046+00:00",
      "content_markdown": "# 21/1 - Tiny Bookshop Game Review - Book Recommendation Gameplay\n\nI played this game yesterday (20 Jan) and really liked the book recommendation system, where based on the customer info (genre they liked, what they're looking for, and their fav book), I can browse through my bookshelves with title and synopsis and recommend a real book.  I also liked how they use real books. I feel happy when I found a book that I've read and I felt interested when I see interesting books that I haven't read.\n\nAnother similar game is Dave The Diver where they use real fishes or sea animals. And I feel happy when I see animals that I've dived with on my dive experience. And feel excited or hopeful when I see interesting animals that I want to dive with someday.\n\nThere ought to be more hobby games where they use real life animals/items/places in the game."
    },
    {
      "id": "d2f3fc67-4453-4992-b71a-b8d12669b8f8",
      "title": "Emotion Regulation",
      "category": "notes",
      "created_at": "2026-01-20T03:21:53.166957+00:00",
      "updated_at": "2026-01-22T03:38:24.302146+00:00",
      "content_markdown": "# Emotion Regulation\n\nOne thing that helped me a lot is emotion regulation. It's the skill where you can choose whether to continue having your emotion or regulate it (dampen it or change it into other emotion) when it doesn't align with your goal. It can be done through many ways, the most common is through narrative reframing.\n\nAll emotions have a purpose and you don't necessarily have to be happy all the time. Pain tell you somethings is wrong with your body. Regret helps you make better decision. But often as human we dwell on certain emotion for too long that it affect us negatively (e.g can't focus, lashing out or getting angry on other, no motivation to work). \n\nThe goal for emotion regulation to me is to notice your emotion quickly when it start to negatively affect you. Then quickly do a certain protocol to regulate the emotion. These protocol are habits or activities that you have to discover over the years that can trigger/resolve specific emotions.\n\nFor example mine are:\n\n- Overwhelmed\n\n  - Write down all tasks and and break it down\n  - Braindumping\n- Unmotivated\n\n  - Watch inspiring videos\n  - Listen to music\n  - Write down or review goals\n- Sad\n\n  - Escapism (read books/novel or watch movies)\n  - Get into flow inducing activity (Play games)\n  - Writing to process emotion\n  - Narrative reframing (find the good in bad & optimism)\n- Envy/Comparison\n\n  - Think of people less fortunate of me and be grateful\n  - Review my past achievements, struggles and  my own goal\n- I'll update this writing with more when i remember"
    },
    {
      "id": "9392ad9f-2749-4405-b166-b6fd3599ebb7",
      "title": "Narrative angle (WIP)",
      "category": "notes",
      "created_at": "2026-01-19T05:49:16.653419+00:00",
      "updated_at": "2026-01-23T10:40:46.585616+00:00",
      "content_markdown": "# Narrative angle (WIP)\n\nHow to create a cohesive narrative towards a certain mission/purpose based on experiences and .\n\nPrinciples that I liked:\n\n- Effective Altruism\n- Relentlessly Resourceful\n- Luck Surface Area\n- Second Brain\n\n## Policies I'd Like in the world\n\n- UBI?\n- \n\nSome thoughts\n\n- Regulations for deepfake porn & misinformation\n\n  - Regulations for GenAI service provides/business to follow certain guidelines\n\n    - Disallow genai image of a real person without consent or verification\n    - Compulsory attribution that it's AI image (watermark, metadata tracker, etc)\n    - Guardrails/censorship against certain content (CSAM, adult content, etc)\n- Does GenAI need to be even anonymous? anonymity in social media is crucial for free speech. But GenAI is not crucial for free speech, and hence anonymity is not crucial for GenAI. What if we introduce e-KYC for genAI providers? or at least for posting genAI content\n- Crackdown on open-source genAI model, and limit or verify access for opensource model. You can regulate providers of the opensouce website. e.g The website hosts, GitHub, HuggingFace, etc"
    },
    {
      "id": "39d8a135-1850-498e-ab04-1fc3c96f492f",
      "title": "My High and Lows",
      "category": "notes",
      "created_at": "2026-01-19T05:44:50.687414+00:00",
      "updated_at": "2026-01-19T06:31:36.245858+00:00",
      "content_markdown": "# My High and Lows\n\nMy hero's journey\n\nLow & struggles:\n\n- Grew up in B40 family (<RM5k household income, bottom 40% of wealth)\n- never had my own room/privacy until i started working\n\n  - affected me socially, speech confidence, social skills, etc\n\n    - Had speech delay as toddler, social anxiety as kid\n- an immigrant\n\n  - Lack of opportunity for scholarship, PTPTN (Education Loan), different school standard\n  - Was charged higher fees for education due to non-local status \n\n    - Luckily obtained a welfare support partially fund my education\n  - Lack of stable base, no inherited house, car, etc\n- Had to start working and supporting myself at 17\n- Had to pay for my sister uni tuition at 21\n- Dad had a stroke when i was 24 years old, parents had no insurace/retirement plan\n- got into $15k credit debt for parents medical bills and supporting my sister\n\nWins:\n\n- Competed in Math olympiads in primary school & won varsity chess comps at 12 and 16\n- Self-taught IGCSE and passed it at 14\n- Entered uni at 15 and graduated as best graduate / valedictorian\n\n  - won Gold Vice Chancellor award, Best International Student Award, Gold FYP award, Gold Capstone award,\n- published game at 16\n- tech intern at 17 and tech club founder at 18\n- co-authored AI research paper with MIT at 19\n- cofounded ai consulting company at 21 with 6-fig revenue\n- co-founded vc-backed ai startup at 22\n- grew 10k followers and 100k users at 23"
    },
    {
      "id": "d8ad85f8-1ca4-479e-8a6f-1aeb18a46701",
      "title": "List of Fellowship",
      "category": "notes",
      "created_at": "2026-01-18T05:42:17.460075+00:00",
      "updated_at": "2026-01-23T10:41:02.637665+00:00",
      "content_markdown": "# List of Fellowship\n\n## [2026 Mozilla Fellowship](https://www.mozillafoundation.org/en/what-we-do/grantmaking/fellowship/2026-nominations-request/)\n\nFunding: $100K stipend and $25K Project budget\n\n- **Nominations Open**: November 9, 2025\n- **Nominations Close:** January 30, 2026\n- **Letter of Intent Deadline:** February 13, 2026\n\n> \"But the Fellowship's greatest value is positioning you as the kind of technology leader the field desperately needs. Mozilla Fellows become the voices policymakers reference when seeking alternatives to extractive technology, the experts journalists quote when covering ethical innovation, and the role models the next generation follows when choosing how to build their careers.\"\n\n- **Fit:** Does your experience match the track you're choosing? Are you ready for this opportunity?\n- **Project:** Do you outline a compelling project that advances a better tech future and that you can realistically execute in 12 months? For Embedded Fellows, does your project compellingly address the Host Organization’s identified issue?\n- **Values:** Does your approach embody technology \"built with care, powered by people, and fueled by imagination\"?\n- **Impact:** Will your work serve communities and help others build better technology futures?\n- **Leadership:** Are you someone who will influence the field and can inspire the next generation of technology leaders?\n\n## [Institute for AI Policy and Strategy](https://www.iaps.ai/fellowship)\n\nFunding: $15K stipend for 3-month program"
    },
    {
      "id": "3d27f159-7910-4985-ae6e-f9bc06a7f9e6",
      "title": "17/1 - Peach & Cream Content Dinner",
      "category": "notes",
      "created_at": "2026-01-17T08:18:24.28747+00:00",
      "updated_at": "2026-01-25T05:05:59.370968+00:00",
      "content_markdown": "# 17/1 - Peach & Cream Content Dinner\n\nThings I need to do:\n\n- [x] Reply to Shiva on Kelas Sekejap\n- [x] Finish passing all the receipts or logins on Lizzie\n- [ ] Plan content for tomorrow dinner?\n- [x] Deploy chrome extension etc. (Submitted extension to chrome webstore)\n\nPlan for tomorrow:\n\n- Merge PRs and deploy functions\n- fix mobile app?\n- Go to the restaurant for content at 6pm\n\nI had a content brand deal today at Peaches & Cream Braserrie Restaurant at 6pm today. Honestly it was quite generous, I can order RM300 of free meal on top of the payment for the content. \n\nWe ordered like RM276 worth of food. And the food was really delicious. Felt really happy with the experience. \n\nMotivated me to do more food review or cafe content."
    },
    {
      "id": "b9ae16fa-42c8-4cee-8131-0188d384200f",
      "title": "16/1 - MRI Scan",
      "category": "notes",
      "created_at": "2026-01-16T11:15:00.524624+00:00",
      "updated_at": "2026-01-25T05:05:39.60092+00:00",
      "content_markdown": "# 16/1 - MRI Scan\n\nFriday,\n\nI went to the tungshin hospital to get the MRI. We walked in and managed to make an appointment immediately there in the afternoon. Compared to UMSC, where we need to wait until 28th before getting the MRI scan. The toal cost is around RM3500 and we had to get 3 scans MRI/MRA CoW and some neck artery or smth.\n\nWe went there around 8.30am and then as it's mostly just waiting. I went to the 500 global office around 11am as there was a VVVIP guest. Mr Goh, which is a forbes 30 that build some tech company before.\n\ni think while waiting there i had a lot of cool thoughts. but i already forgotten most of it.\n\nLike on AI ethics, the deepfake concern due to grok. etc."
    },
    {
      "id": "ae4d08ab-a79b-46f5-9533-4a2f924205f9",
      "title": "15/1 - Cleve Chrome Extension",
      "category": "notes",
      "created_at": "2026-01-15T11:14:45.711523+00:00",
      "updated_at": "2026-01-26T06:35:40.307515+00:00",
      "content_markdown": "# 15/1 - Cleve Chrome Extension\n\nThursday, i was mostly busy doing the Cleve chrome extension."
    },
    {
      "id": "c8d49cd7-d3c1-4124-afcd-2f021373eb60",
      "title": "14/1 - Cleve Chrome Extension for syncing saved posts",
      "category": "notes",
      "created_at": "2026-01-14T12:28:23.819291+00:00",
      "updated_at": "2026-01-14T12:29:28.41906+00:00",
      "content_markdown": "# 14/1 - Cleve Chrome Extension for syncing saved posts\n\nI've been working on this chrome extension for a while. to sync saved post across various social media. ive been stuck on 1 problem. tiktok collection issue."
    },
    {
      "id": "3b31a95f-2930-46aa-a2cd-10c903a2d15f",
      "title": "13/1 - Cleve Transcriber, edit mode",
      "category": "notes",
      "created_at": "2026-01-13T07:52:11.534245+00:00",
      "updated_at": "2026-01-13T05:42:43.33878+00:00",
      "content_markdown": "# 13/1 - Cleve Transcriber, edit mode\n\nJust completed the content extraction tool for cleve. Now you can paste a url and it can transribe the script/caption/etc. And chat with AI about the video.\n\n![image.png](https://hkqfndytgnnwadrfsfvp.supabase.co/storage/v1/object/public/photo-clips/3e2fbeab-0ea3-4e9c-a770-1db820e457e0/1768282783175_t71xu3zof.png)"
    },
    {
      "id": "b8ddb6cb-e642-46d6-ad1f-4f49176039aa",
      "title": "12/1 - AI edit mode",
      "category": "notes",
      "created_at": "2026-01-12T03:27:13.706883+00:00",
      "updated_at": "2026-01-25T05:05:15.439265+00:00",
      "content_markdown": "# 12/1 - AI edit mode\n\nThings I did:\n\n- [x] Fix mobile cleve-web chat not working\n- [x] Edit mode\n- [x] Transcriber tool\n- [ ] Reply to Junaid (only replied halfway)\n- [ ] went to UMSC to get consultation about my dad"
    },
    {
      "id": "e9a06e39-b678-405e-ab00-26311cb9cc55",
      "title": "11/1 - File Tree System",
      "category": "notes",
      "created_at": "2026-01-11T14:56:30.72843+00:00",
      "updated_at": "2026-01-12T03:10:17.71532+00:00",
      "content_markdown": "# 11/1 - File Tree System\n\nImplemented file tree structure for Cleve\n\nI read like 20 pages of Utopia for Realist book.\n\nThings done:\n\n- File tree system in Cleve ✅\n- Changeable icon for folder ✅\n- Local sync ✅\n- Edit mode toggle (WIP)\n- IG/TikTok Transcriber (WIP)"
    },
    {
      "id": "317bb01a-1b77-4ad7-8642-976df8c8ae86",
      "title": "10/1- Subscription Experience",
      "category": "notes",
      "created_at": "2026-01-11T14:56:22.63028+00:00",
      "updated_at": "2026-01-12T03:22:43.523101+00:00",
      "content_markdown": "# 10/1- Subscription Experience\n\n## Work\n\nBugfix day\n\n  ✅ Fix trialing subscription not getting recognized\n\n  ✅ After subscription experience\n\nFor the after subscription, I added confetti and animation:\n\n![image.png](https://hkqfndytgnnwadrfsfvp.supabase.co/storage/v1/object/public/photo-clips/3e2fbeab-0ea3-4e9c-a770-1db820e457e0/1768188131128_pwu6bgwec.png)\n\n## Leisure\n\nWatched 100 Meters, the animation movie about running. Really cool animation using rotoscoping, nice theme, but i didn't like the ending as much. \n\nI logged it at [Letterboxd](https://letterboxd.com/mfrashad/film/100-meters-2025/)\n\nbut here is my review:\n\nlove the animation with rotoscoping. That was my first time watching an animation like that. I like the theme of running, chasing passion, devoting your life to a craft or a goal, and putting an obsessive amount of effort. I know the ending is an artistic choice of emphasizing the journey is more important than result. But it was still unsatisfying, i think i wanted to see the payoff, of all that effort/obsession, i wanted to see the character reach their goal and validate that their effort matter.\n\ni think showing the end result, and showing how the characters come to term with the result would be much more impactful rather than just cutting it off to a black screen a moment before the results shown."
    },
    {
      "id": "8afb6f53-4bcd-425d-8412-3e2fa7038373",
      "title": "9/1 - Claude Code with Linear MCP is great",
      "category": "notes",
      "created_at": "2026-01-10T03:52:24.636496+00:00",
      "updated_at": "2026-01-10T06:52:28.312847+00:00",
      "content_markdown": "# 9/1 - Claude Code with Linear MCP is great\n\nIn Cleve, we just restarted our Linear usage for issue tracking.\n\nPreviously we were already using it, but at some point stopped using due to inconvenience of filling or updating the issue\n\nBut now since most of our coding is empowered by claude code even our commits and in making PR, adding linear MCP makes this very convenient. Claude code are able to pull the issue details easily and document the PR even better, and update the linear issue at the same time.\n\nHere is some progress changelog for Cleve today:\n\n- Optimistic update for delete\n- Folder switching not switching properly\n- Models are locked for paid users\n\n#"
    },
    {
      "id": "507d4d72-3e42-4bc9-a06c-daf6f411016c",
      "title": "9/1 - Best hospitals to visit for stroke?",
      "category": "notes",
      "created_at": "2026-01-10T03:50:08.169433+00:00",
      "updated_at": "2026-01-10T06:52:19.084015+00:00",
      "content_markdown": "# 9/1 - Best hospitals to visit for stroke?\n\nI went to my parents house just after Friday prayer. \n\nAnyway we were discussing on which hospital to check?\n\nSo far my parents have been to the HKL gov hospital. And they waited like 24 hours there, and the response was not much can be helped except preventing the next stroke and giving meds prescription.\n\nMy mother tried to insists on getting the scans or test results. But apparently they can't give it. You have to request for it in some department, which we did, but then we'll only get it next months.\n\nI wonder the reason for this? to prevent ppl exploiting the gov to get cheap tests, and then go to private hospital using the tests result? it doesn't make much sense.\n\nSo far, from my parents friend. We were recommended UMSC or Prince Court in KL for second opinion. And also Abdi Waluyo hospital in Jakarta. I'll probably need to research more on this hospitals. From reddit, all three of these seems to have good review.\n\nThe other ones mentioned are HPUPM or HSAAS which national stroke centre.\n\nThey just went to get an appointment for UMSC today. Which will be on Monday."
    },
    {
      "id": "d2615962-101a-4dab-bcbb-8a12ea53d43b",
      "title": "Notes vs blog (this writings are notes not blog)",
      "category": "notes",
      "created_at": "2026-01-09T01:06:25.543091+00:00",
      "updated_at": "2026-01-09T02:40:05.210762+00:00",
      "content_markdown": "# Notes vs blog (this writings are notes not blog)\n\nMy main barrier in writing is the usual perfectionism, where I keep thinking the writing is not good enough to publish. I keep polishing and polishing and never actually published the writing.\n\nThese living notes are my solution to that. Why not just publish my work in progress notes publicly and let the writing grow as i write it. But this remove the barrier of constantly thinking of publish or not, and just publish it from day one.\n\nI just need to put a disclaimer for the readers that these are my notes and not blog. And they are often unpolished. And my ideas and opinion are in the moment and are prone to change. \n\nYou may think that I already have a separate writing place for unpolished writing. e.g my drafts, notes, diary.\n\nBut the feeling is different when these drafts are just hidden inside your private notes. You often end up abandoning them because there is no incentive.\n\nBut by making your notes public, I will have the urgency to finish or polish my notes as I don't want people to misunderstand or see my unpolished thought and would rather them see the polished or completed version."
    },
    {
      "id": "642b4bfe-2a18-4ed5-9d8f-fad7c276f9c6",
      "title": "8/1 First day in office after new year and meeting Sofea",
      "category": "notes",
      "created_at": "2026-01-09T00:53:19.888561+00:00",
      "updated_at": "2026-01-09T01:22:22.71547+00:00",
      "content_markdown": "# 8/1 First day in office after new year and meeting Sofea\n\nTags: #journal\n\nWent to the  for the first time after new year. And also met Sofea, our marketing intern, previously. She's really nice and bubbly and gave me a chocolate and a note. I kinda feel bad for not communicating to her as much tbh during the internship period. But honestly I'm really bad at virtual communication.\n\nHonestly i didn't feel like writing about the day as I got the  in the morning. \n\nBut we did the demo, talked about the plan for new year. Faw is gonna work on refactoring the app to use next-forge and convex. Lizzie gonna work on content. and Ashvin, probably content too, customers stuff, and some frontend work.\n\nAfter work, I went straight to my parent's house.\n\nThen we had dinner with my mom's friend family. She is a psychologist and she had dealt with family members with stroke before. I think her father and her husband had strokes before. She gave us advice on how to navigate the health recovery options, which hospital or doctor, potential recovery options, e.g speech therapy, flushing the blood, just meds, etc. And how to deal or communicate with my dad as the patient.\n\nIt's interesting to see Rangga, her kid that I met like 10 years ago. He's so big and muscular now. Made me feel like I should workout too. But tbh, it's not really priority and maybe it's luxury and privilege i can't have right now. And the time and money is better spent on working and my financials. Anyway they are really nice, they treated our family for dinner, we visited their house, and gave us Mixue on the way back.\n\nOn our home, one of relatives from Indonesia were visiting. And since the beds are given to them, and there is barely any room left, I just go back to my house around 12-1am."
    },
    {
      "id": "9c8991d9-0443-4df2-9b6f-1bd09369eae0",
      "title": "We got into 500 Global AI residency",
      "category": "notes",
      "created_at": "2026-01-08T23:48:34.969937+00:00",
      "updated_at": "2026-01-09T00:08:09.647846+00:00",
      "content_markdown": "# We got into 500 Global AI residency\n\nJust sharing a story on how we got into this really cool community in KL.\n\nSo 500 global is one of the largest VC and they invest in a lot of prominent companies around here, e.g Grab, Vida, Carousell, etc.. and, Khailee, a legendary Malaysian startup pioneer (he built [Says.com](http://Says.com) and some other stuff) is currently the managing director of 500 global southeasts Asia.\n\nAnyway Khailee wanted to support the AI ecosystem or community in Malaysia and generously opened his office to some AI builders here. The OG of these builders are Joseph (Docuask founder0 and Isaac (CTO of Supa). And Joseph also created this AI community group AI Tinkerer's KL where they host bi-weekly co-working session or talks. And Joseph, like a cool guy he is, he wanted to support some of the really high-performing builders that he saw in the AI Tinkerer's, so he also generously bring them in to the 500 global budding AI residency. And now we have quite a number of people here. We also got invited as we got to know Joseph and gave talks in his AIT event. \n\nIt's a really cool place now tbh, the rule is you have to demo every thursday to show that all of us are constantly building and create the culture of constantly making progress and shipping. And all of the members are by referral basis, i think the main criteria is just to be very collaborative and helpful to everyone. We don't want people to gatekeep and compete in zero-sum away. But rather create a collaborative space where everyone can help each other and elevate the southeast Asian space into a startup hub like Silicon Valley for example."
    },
    {
      "id": "708a432b-70e5-4bf6-907a-eaa4b2ee232f",
      "title": "8/1 - On health and working harder",
      "category": "notes",
      "created_at": "2026-01-08T08:51:14.910709+00:00",
      "updated_at": "2026-01-09T03:46:48.956467+00:00",
      "content_markdown": "# 8/1 - On health and working harder\n\ntags: #journal\n\nToday was Thursday. (To be honest, I'm actually writing this right on Friday, the day after. but I'll pretend I'm writing on the same day)\n\nToday I got a surprising call. My dad just had a stroke. He felt it about 4 days ago when he was in Aceh. He mentioned to my mom he had difficulty in speaking. But my mom didn't really understand since he seems to be able to speak to her. But 1-2 days after, he start to feel other symptoms and suspected stroke. Anyway, he flew back to KL just last night with my mom and flew immediately to HKL. and diagnosis says it's true. He's having speech difficulty right now, and the doctor says the affected brain area is irrecoverable. (but obviously, we're gonna check on more hospital to get different opinion)\n\nThis fact is sadder because speaking is ultimately his bread & butter for decades now as a teacher. I think if it was the droopy face symptom, it wouldn't hit him as hard.\n\nBut in a way we are also lucky, my dad seems to be able to move normally, still alive and didn't collapse.\n\nTo be honest, I already expected this day to come, my dad is pretty old (67) and he already has diabetes. But I didn't expect this to come so soon. I still felt wholly unprepared. (I'm not sure about the emotional aspect, because I generally is quite emotionless or i just avoid them, I'll mainly discuss on more of the logical side. But I do think I feel sadder than I expected)\n\nI've been dreading the day where my dad is unable to work, as some of my sibling are still depending on him. I've been dreading that I would need to support both my parents financials (since they are the type to have no insurance or retirement plan) on top of the gap my siblings funding (mainly for their education) that would happen after my dad stop working. I was hoping we had 1 more year, where both my siblings would have finished their uni and be more independent. And I'd have 1 more year to struck it rich.\n\nI've been justifying sacrificing my time or energy for working or investing in myself rather than family, so I can reach financial success much faster and be able to help the family much more later. And logically it makes sense to me to just put intense effort in 2-3 years, set a clear boundary for me to achieve and, and then be financially free. And I'll have a lot more free time or resources after that to help my family in any way. Rather than splitting my attention and energy while doing my startup.\n\nBut I'm too slow. And I'm starting to feel guilty now for not working as hard. There are many instances where I feel like I definitely slacked off with the excuse of my own happiness or mental health or my own laziness. And I didn't feel the pressure to survive anymore as I felt in my own uni. I should have realized that I really don't have the luxury. I could've cut off with all the time i spend on watching movies/manhwa/playing games etc. Or the time i spent on people or experience that was for my own happiness but not as necessary.\n\nI think it was a wakeup call for me to my discipline and also in my own health i guess. I also feel like taking care of my health better e.g reduce sugar.\n\nBut to be honest, I'm not sure the better course of action after this. Even if I suddenly were to work hard. Which aspect should I work harder? should I actually sacrifice more of my work time to spend time for my family? or double down on work so we actually have money.\n\nProbably the former. Worst case scenario, I can just be in debt, but I'll be fine. But I won't be able to have the time with my parents back and i might regret. In terms of trying to work harder, instead I can start cutting off in my luxury, e.g time wasted on doomscrolling, money wasted on eating out, etc. And just be more disciplined in general.\n\nBut yes here's to my newfound commitment now \n\n- start drinking plain water when eating out\n- go back to my oatmeal with fruits routine\n\n  - less eating out? get cheap meals (rice and eggs, maggi, etc)\n- start my habits & habit tracking again\n- cut down on doomscrolling, mahwa, movies, games\n- stop spending money on things that are not as necessary\n\n  - it's fine if it'll significantly improve my life it's fine (e.g phone, laptop, workout equipment, microphone etc)\n  - if it's just my wants (e.g escape room, eating out, fun experiences, travel, etc) maybe I'll cut it down"
    },
    {
      "id": "2813c1a2-62fb-4a5f-8830-4f4120767726",
      "title": "7/1 - GTD, Obsidian",
      "category": "notes",
      "created_at": "2026-01-07T18:49:35.526912+00:00",
      "updated_at": "2026-01-09T00:20:00.04889+00:00",
      "content_markdown": "# 7/1 - GTD, Obsidian\n\nTags: #journal\n\nHere is what i did today:\n\n- Implemented custom domain feature for cleve publishing\n- bidirectional link and  graph viewer like how obsidian does it.\n- merge and approve several PR for Cleve\n- bought macbook (5K) macbook air 13-inch 512gb\n- paid several bills: car, internet, & cards\n- went climbing/gym and cancelled BUMP membership\n- added animation to my personal website\n\nI think it's quite productive day\n\nWhile I was building the bidirectional link feature like obsidian, I also got reminded on my old obsidian setup, and made me read  concept again. Now that Cleve has this feature, I'm thinking of setting it up on Cleve this time.\n\nAlso had the idea of having auto-sync feature with obsidian. I mainly just need to create a file system like organization for Cleve instead of 1 category per writing. The easiest way to do this i think is letting category row have a category itself. So category can also have a category."
    },
    {
      "id": "1f3100cb-5fab-4a4d-a2b7-c011ef175b40",
      "title": "Getting Things Done",
      "category": "notes",
      "created_at": "2026-01-07T18:40:56.30977+00:00",
      "updated_at": "2026-01-07T18:49:33.618867+00:00",
      "content_markdown": "# Getting Things Done\n\nI was sharing about my old getting thins done (GTD) setup just now. And it's actually quite impressive how much notes I've written in obsidian and how elaborate it.\n\nHere is my obsidian graph:\n\n![image.png](https://hkqfndytgnnwadrfsfvp.supabase.co/storage/v1/object/public/photo-clips/3e2fbeab-0ea3-4e9c-a770-1db820e457e0/1767811469080_9hc7jfa0k.png)\n\nI got really into this second brain method after first getting exposed to it by Ali Abdaal. I saw his recommended book on Building a Second Brain and some of his youtube video on how he manage his notes, and I was impressed.\n\nThen I searched on what is the best book to introduce me to this and got into 2 recommendation.\n\nBuilding A Second Brain (BASB) by Tiago Forte & Getting Things Done (GTD) by David Allen.\n\nPersonally I recommend BASB over GTD. Mainly because GTD is based on traditional method aka (physical files and paper), while BASB is more relevant to current times. \n\nIf you have time to read both, it'd be the best tho.\n\nThen BASB and GTD itself only present the system, but how to implement the second brain and what tools to use is up to the people. I personally found obsidian to be the best for me as dev. I really recommend Nick Milo and Aiden Heart content, those are what I use to setup my own obsidian.\n\nPersonally I recommedn reading BU"
    },
    {
      "id": "d953bbd4-16b3-4f4d-a81f-ac226162cb1f",
      "title": "Breakout Escape Room Spy Game review",
      "category": "notes",
      "created_at": "2026-01-06T15:05:35.796993+00:00",
      "updated_at": "2026-01-08T23:52:28.943743+00:00",
      "content_markdown": "# Breakout Escape Room Spy Game review\n\nToday, I went to an escape room variant 'Spy Game' at The Curve. The main difference is it has NPC actor and you need to hide, disguise, or even steal things from them. \n\nIt's pretty fun honestly. \n\nThe main drawback is it's too short and feel rushed.\n\nI didn't get to enjoy the puzzle as much. Mainly because of the short time, and because i constantly worry about the actor coming in and catching us.\n\nI think if they separate the phase, where there are phase we don't have to worry about the actors, and there are rooms where it'll be mainly for actor interaction rather than puzzle, that would be great."
    },
    {
      "id": "08b56ecc-7331-4ecb-8296-cba385cd24f5",
      "title": "Features I want in Cleve",
      "category": "notes",
      "created_at": "2026-01-05T14:56:35.531178+00:00",
      "updated_at": "2026-01-12T03:07:38.979766+00:00",
      "content_markdown": "# Features I want in Cleve\n\nI recently wrote about \"It's okay to do cool features instead of what your customer want for your own motivation\"\n\nHere are my personal lists of features i want in Cleve:\n\n- Bi-directional links ✅ (7/10/26)\n- Graph viewer for bidirection links ✅\n- Instagram/TikTok transcriber/scraper\n- Chrome extension that search and collect saved post and integrate with Cleve\n- Auto-sync with Obsidian ✅\n\n  - need filesystem/category ✅\n  - local filesystem sync ✅\n  - livesync / obsidian plugin & handle obsidian format import\n- streaks\n\n  - check thinkdeli\n- achievement badges\n- better markdown formatting\n\nI should update these in  too as I progress."
    },
    {
      "id": "b68827b5-fc54-4f6c-a6cd-9592aa66e527",
      "title": "It's okay to do cool features instead of what your customer want for your own motivation",
      "category": "notes",
      "created_at": "2026-01-05T14:47:55.336608+00:00",
      "updated_at": "2026-01-07T10:56:56.808988+00:00",
      "content_markdown": "# It's okay to do cool features instead of what your customer want for your own motivation\n\nWhen building a startup, you often get forced into trying to build for features that customers want or you think that they need. And sometimes this might be features you are not excited of.\n\nIt's fine once in a while. But then you realize startups often have an infinite backlog of features that you need to build. And the time you are waiting where you are free to do cool features that you want instead of what the business need never come.\n\nAs someone whose productivity is dependent on his interest. I can get demotivated easily when i'm stuck in these situations. \n\nIn those days, I realize the best cure is to just have fun sometimes and satisfy my inner nerd or interest. \n\nOnce in a while, forget the customer\n\nJust build whatever feature  you want or think it's cool.\n\nIt can reignite your love for coding or building stuff  when you feel burned out\n\nand as a result, you will be even more productive in the long run.\n\nFollowing this advice, here are ."
    },
    {
      "id": "f8d581ee-e5b1-443c-8719-f7f3e1b9f900",
      "title": "Lists of bugs of this personal website",
      "category": "notes",
      "created_at": "2026-01-05T14:35:46.374096+00:00",
      "updated_at": "2026-01-05T14:46:21.123375+00:00",
      "content_markdown": "# Lists of bugs of this personal website\n\nI just rebuild my personal websites recently: mfrashad.com\n\nHere are lists of bugs that I should fix as i continue writing on my website as a blog:\n\n## Bugs\n\n- The new writings order in the main page are in reverse order compared to the cached writing\n\n## Improvements\n\n- The website are kinda slow, either optimize it or add loading animation\n\n## Ideas\n\n- Add floating effect or parallax scroll animation to the draggable polaroid or decorations\n- Add rive avatar animation that follows cursor as my avatar\n- Add interactions to the draggable decorations\n\n  - click kindle -> open kindle and you can see my books list or read books, or simulate kindle\n  - click CD -> open music player list of my fav music\n  - click notebooks, open a 3d flippable books, with my blog page by page\n  - click laptop -> see my projects  on laptop mockup"
    },
    {
      "id": "12e3b35c-e8fd-4c95-b96b-86602a5ef1e6",
      "title": "My Goals 2026",
      "category": "notes",
      "created_at": "2026-01-05T14:03:49.57568+00:00",
      "updated_at": "2026-01-05T18:52:05.830546+00:00",
      "content_markdown": "# My Goals 2026\n\nHere are my goals for 2026, I usually like to do SMART goals, aka specific, measurable, achieveable, relevant, and time bound.\n\n## 🎯 Outcomes based goals\n\n- [ ] 100K followers\n- [ ] 3 Award/Grant/Fellowship/Trip\n- [ ] $10K MRR for Cleve\n- [ ] $10K/month income\n- [ ] Get into SF/Trip to SF\n- [ ] Read 24 books\n- [ ] Start 1 social iniative\n- [ ] 5 paid talks\n- [ ] 5 brand deals\n\nThe problem with this is these metric are outcome based and not fully under my control. \n\nSo instead, I'll convert these SMART outcome goals into a action based goals to achieve those outcome. For example: get 100K followers -> post every day.\n\nIn my case, here are my action-based items for the goal above:\n\n## 🏃 Action based goals\n\n- write everyday\n\n  - finish a thought piece every week, turn into -> text post or carousel, video \n\n    - decision: (hire someone to convert thought piece to posts?) / automate\n- post once a week\n- apply to an award/grant every month\n\n  - search and list down awards every 3 months\n- Read 1 pages of non-fiction every day\n\n## Method\n\nbased on the annual reflections i have. Here are some improvements that I think can help\n\n### Productivity\n\n✅ Only accept paid speaking engagements (except high profile/pro-bono event)\n\n🤔Hire a slide designer for talks?\n\n✅ Unsubscribe BUMP Climbing Gym\n\n🤔Subscribe to Evolveflex Fitness?\n\n🤔 Buy an iphone/android\n\n🤔Buy a macbook air\n\n✅ Track habits properly\n\n- HabitDone apps for habit, Hardcover for books, Hevy for workout, Letterboxd for movie,\n\n### Content\n\n🤔 Hire a social media editor/manager\n\n✅ Setup buffer & auto schedule to X, Thread, Mastodon, Instagram, Twitter\n\n✅ Bulk create thought piece or content scripts\n\n## Task Lists\n\nGrant/Award/Fellowship\n\n- [ ] List 10 grants / iniative\n- [ ] apply to mozilla foundation fellowship (deadline 30 Jan)\n\nContent\n\n- [x] set up blog system\n- [ ] write content plan/calendar\n- [x] setup buffer with my account"
    },
    {
      "id": "3f6a2b14-5952-4ce9-bf9d-5f0c04de4d9a",
      "title": "Lists of my favorites",
      "category": "notes",
      "created_at": "2026-01-04T16:07:19.109254+00:00",
      "updated_at": "2026-01-07T07:36:44.088983+00:00",
      "content_markdown": "# Lists of my favorites\n\nLive note of my top lists to be put on the website\n\nThis website still has a lot of bugs: \n\n### Best Purchases\n\nsome of my fav physical product i own right now\n\n- Kindle\n- Canon M50 Mark II camera\n- Soundscore Space A40\n- A mini bedroom projector\n- Foldable phone magnet tripod\n\n### Favorite Software:\n\n- Readwise\n- Linear\n- Cursor / VS Code\n- Cleve\n- Raindrop\n- Obsidian\n- Diarium\n- Posthog\n\n### Favorite Podcast\n\n- Huberman Lan\n- Lenny Podcast\n- Diary of a CEO\n- Lex Fridman\n\n### Favorite Blog\n\n- Paul graham's blog\n- lesswrong forum\n- https://www.neelnanda.io/\n- waitbutwhy\n- YC Website\n\n### Concepts I Liked\n\n- Gamification\n- Quantified Self\n- Surface area of luck\n- Growth Mindset\n- Be relentlessly resourceful\n- Stoicism\n- ...\n\n### Fav Non-Fiction Books\n\n- Atomic Habits\n- Die With Zero\n- Doing Good Better\n- Millionaire Fast Lane\n- Deep Work by Cal Newport\n- Educated by Tara Westover\n- Models by Mark manson\n- The Slight Edge\n- Building a Second Brain\n- Getting Things Done\n- Flow\n- Be So Good They Can't Ignore You\n\n### Fav Novels\n\n- Project Hail Mary\n- Babel\n- Red Rising\n- Dark Matter\n- The Hunger Games\n- Mistborn\n\n### Fav Webnovels\n\n- Omniscient Reader's Viewpoint (ORV)\n- Mother of Learning\n- Perfect Run\n- Shadow Slave\n- The Novel's Extra\n- Regression Instruction Manual\n- Everyone Else is a Returnee\n- The Tutorial is Too Hard\n- Primal Hunter\n- Mushoku Tensei\n- Coiling Dragon\n\n### Fav Anime\n\n- Code Geass\n- Death Note\n- To Your Eternity\n- Clannad\n- Angel Beats\n- 86\n- Bakuman\n- No Game No Life\n- Sword Art Online\n- Dr. Stone\n- Demon Slayer\n- Zetsuen No Tempest\n\n### Fav games\n\n- Inscryption\n- Outer Wilds\n- Dave the Diver\n- Hades\n- Hades II\n- Baldur's Gate III\n- Stardew Valley\n- 12 Minutes\n- Rimworld\n- Ori Game series\n- Metal Gear Solid V\n- Undertale\n- Clair's Obscur: Expedition 33\n- The Witcher\n- Cyberpunk\n- Europa Universalis 2"
    },
    {
      "id": "b94a277f-cdcb-4e6e-9738-f88fb9229ba9",
      "title": "I will start journaling from Cleve now",
      "category": "notes",
      "created_at": "2026-01-04T13:58:45.137586+00:00",
      "updated_at": "2026-01-09T03:47:39.372839+00:00",
      "content_markdown": "# I will start journaling from Cleve now\n\ni was trying to update my personal website as a fun thing to do for new year\n\nthen i thought of just using cleve for my blog. then i just tried building the API integration feature and publishing thing, and claudee code manage to build the feature and it works pretty well\n\nTesting Image\n\n![Untitled design (8).png](https://hkqfndytgnnwadrfsfvp.supabase.co/storage/v1/object/public/photo-clips/3e2fbeab-0ea3-4e9c-a770-1db820e457e0/1767541811655_tucy6dvfm.png)\n\n### Testing Markdown format\n\n- helllo\n\n(Link)[https://google.com]\n\nhttps://cleve.ai\n\nTesting footnotes\n\nHere is **a** simple footnote[^1]. With some additional **text** after it.\n\n[^1]: My reference."
    },
    {
      "id": "ad66b998-a998-437c-b660-b20b78fa72ea",
      "title": "My Unconventional Career Path",
      "category": "notes",
      "created_at": "2026-01-02T23:03:48.837091+00:00",
      "updated_at": "2026-01-02T23:04:07.847257+00:00",
      "content_markdown": "# My Unconventional Career Path\n\nso since some people are asking for details, here's long version how i did my unconventional career path\n\n───────────────────────────────────────\n\nAge 14 - I was rotting in school\n\nnot much STEM programs or competitions. just memorizing stuff I didn't care about\n\nand I stumble on this hack: you can take university entrance exams (IGCSE) without going to an international school & at any age (not sure about the age actually)\n\nso I'm like... wait what? let's try it\n\n───────────────────────────────────────\n\nthe constraints were brutal:\n\nI registered immediately, but only had 4-6 months to learn 2 years of material. everything in English (had to relearn all the terms). RM500+ per exam. family couldn't afford tutors. still had to go to regular school during the day\n\nso I just... studied on my own at night\n\n───────────────────────────────────────\n\nmy \"education system\":\n\nKhan Academy + borrowed textbooks + random YouTube videos\n\nzero teachers. zero mentors. just curiosity and internet access\n\nfunny how the best education I got was free and available to anyone\n\n───────────────────────────────────────\n\nresults? barely passed.\n\nbut here's the thing - I learned more in those 4-6 months than I did in years of traditional school\n\nbecause I chose to learn. didn't feel forced. actually enjoyed reading the textbook every night\n\nthat's the unlock right there\n\n───────────────────────────────────────\n\nAge 15-16 - started uni in mechanical engineering\n\nhated it. way too theoretical\n\nso I taught myself to code, built an app, switched to computer engineering\n\nthe lesson? don't be precious about your path. pivot fast\n\n───────────────────────────────────────\n\nAge 17 - got my first internship as a software engineer\n\nstarted freelancing on the side\n\nand I learned something important: companies don't care how old you are. they care if you can ship\n\ncan you ship? cool, you're hired\n\n───────────────────────────────────────\n\nAge 18 - started a tech club. gave workshops. won hackathons\n\nwhy? because I was terrified of public speaking\n\nand I figured the best way to get over a fear is to just do it over and over until it's not scary anymore\n\nworked pretty well tbh\n\n───────────────────────────────────────\n\nAge 19 - started an AI blog\n\nthat blog led to my second internship as an AI engineer and then this crazy opportunity to co-author a paper with MIT\n\nstill in uni doing all my assignments\n\n───────────────────────────────────────\n\nhow? I just said no to everything that didn't matter\n\nno partying. no random clubs. just focus on the stuff that compounds\n\none blog post can lead to infinite opportunities. that's leverage\n\n───────────────────────────────────────\n\nAge 20 - graduated with awards, gave the valedictorian speech\n\neveryone's like \"wow you're so smart\"\n\nbut they didn't see me falling asleep on textbooks every night at 14\n\nit wasn't intelligence. it was just reps\n\n───────────────────────────────────────\n\nAge 21-22 - started an AI consulting biz\n\nfreelanced while traveling\n\nmost clients came from people reading my blog\n\nwild how that works - you write online, strangers trust you, they hire you\n\ninternet arbitrage is insane\n\n───────────────────────────────────────\n\nAge 23 - joined a VC-backed startup as cofounder/CTO\n\nhit $5K MRR and 20K users 6 months after launch\n\nalso did hackathons, talks, TV, podcast, grew TikTok to 10K\n\neverything just started compounding at once\n\n───────────────────────────────────────\n\nhere's what I'd tell my younger self:\n\nstart before you're ready. learn because you want to, not because you have to. say no to almost everything. build stuff people want. write online consistently\n\nthat's basically it\n\n───────────────────────────────────────\n\nnot gonna lie, I got lucky in a bunch of ways\n\nbut mostly I just started early and kept going\n\nif you're thinking \"I should do X\" - just start today. don't wait for perfect conditions\n\nthey're never coming"
    },
    {
      "id": "c8260c7a-6f9b-4543-9595-9ff2f4f20c0f",
      "title": "Toastmaster Speech Structure",
      "category": "notes",
      "created_at": "2026-01-02T22:50:29.426144+00:00",
      "updated_at": "2026-01-02T22:50:59.219786+00:00",
      "content_markdown": "# Toastmaster Speech Structure\n\n## OREO\n\n- Opinion, Reason, Examples, Opinion\n- Bonus: Add CTA at the end\n- Simple agreeing or disagreeing with a point\n\n## Pendulum\n\n- Opinion with arguments of both sides\n- Side 1, Explain, Side 2, Explain, Opinion\n\n## Balance\n\n- Being neutral/give alternative opinion from both sides\n- Side 1, Explain, Side 2, Explain, Neutral/completely new opinion\n\n## Problem/Solution\n\n- Problem, Cause, Solution\n\n## Timeline\n\n- Past, Present, Future, Conclusion\n\n## Zoom (Micro/Macro)\n\n- Offer perspective in different scale\n- perspective 1, perspective 2, perspective 3, conclusion/CTA\n- Perspective should vary in scale,\n- e.g (personal, family, work) or (home, organization, world)\n\n## Triangle Method\n\n- Offer different perspective\n- perspective 1, perspective 2, perspective 3, conclusion/CTA\n- E.g perspective as a parent, a wife, and a worker"
    },
    {
      "id": "c2d319b4-a1e0-4a83-8e79-cd7b20352372",
      "title": "What Differentiate Bragging and Inspiring",
      "category": "notes",
      "created_at": "2026-01-02T22:48:28.852795+00:00",
      "updated_at": "2026-01-02T22:50:10.145113+00:00",
      "content_markdown": "# What Differentiate Bragging and Inspiring\n\nI went to Instagram and saw a post by [redacted]. he bought a Tesla. I'm not sure how I feel. Envy? I thought for a second that I'll promise that I'll not be showing off my Tesla in the future. But could I do that? Was it so wrong to show off the Tesla? It's promoting EV after all. But at the same time, Tesla is RM200k, it's excessive luxury.\n\nThis is something I should ask myself.\n\nDo I want to be someone that display their wealth? At what condition can I display my wealth. Or display anything at all like virtues, piousness, etc?\n\nPros:\n\nCredibility, status = better treatment, inspiring\n\nCons:\n\nRia, incite envy, making people compare\n\nI don't want to make people envious, I want to make people inspired. How do I do that? How to show off to inspire? What separates them?\n\nDo I want to be known and respected for their wealthiness? No, I want to be known more by my virtues and knowledge. Does that mean it's okay for me to show off virtues and knowledge but not wealth?\n\nOr maybe I should just separate my showing off for status and my showing off for inspiration. Like the article about separating fuzzy and utilons in donation. Personal instagram for stroking my ego, and other platform to inspire and add value?\n\nBefore I post something ask myself, why?\n\nSome rules,\n\n- Don't share purchase or wealth unless it's review or it adds value\n\n- You can share if you want to normalize something (donation, running)\n\n- Share if it's inspiring (refer to my own experience, what kind of content have inspired, what kind have made me envious). What makes it inspiring if it includes the process and make people believe that they can do that, not that I can only do it because it's me\n\n- Refer Storyworthy? Stories worth sharing are the ones that reflect changes?\n\n- Share something if it add value to someone life (info)"
    },
    {
      "id": "0159251c-388e-49ef-8517-51aa8deae993",
      "title": "Keys to Success are Growth Mindset & Bias for Action",
      "category": "notes",
      "created_at": "2026-01-02T22:47:28.081405+00:00",
      "updated_at": "2026-01-02T22:48:18.987396+00:00",
      "content_markdown": "# Keys to Success are Growth Mindset & Bias for Action\n\n![image.png](https://hkqfndytgnnwadrfsfvp.supabase.co/storage/v1/object/public/photo-clips/3e2fbeab-0ea3-4e9c-a770-1db820e457e0/1767394075544_x609prbsp.png)\n\nAchieving any goal is comprised of two things: \n\n- The information gathering/planning\n\n- Actually doing the work. \n\nHumans already have the motivation for self-improvement by nature (self-determination), but growth mindset allow them to improve in any areas, including the knowledge of how to achieve success, and and set goals to improve on these other critical factors for success (e.g time management, leadership, communication, financial literacy, etc.).\n\nHowever, setting goals and planning would achieve nothing if there is no action. This is why bias for action and actually doing the work is important.\n\nThe second most important after growth mindset and bias for action is grit. Growth Mindset and Bias for Action complete the iterative loop for improvement. Grit is the speed of iterating this loop and how often you repeat the process. It gives the drive to keep improving (planning & executing) and the resilience to keep trying (repeating the process).\n\nFor other things, refer to Sam Altman's Post on Key to Success"
    },
    {
      "id": "69467523-8f6d-411d-a654-867a0c2dbc99",
      "title": "Fake it till you make vs being amateur openly",
      "category": "notes",
      "created_at": "2026-01-02T22:45:44.938901+00:00",
      "updated_at": "2026-01-02T22:46:08.809245+00:00",
      "content_markdown": "# Fake it till you make vs being amateur openly\n\nThe strategy I often use so far is 'fake it till you make it'. I've avoided sharing opinions or thoughts publicly that could reveal my inexperience, and only stick with objective facts like technical blogs or credentials.\n\nAnd it worked really well for me honestly. I got many opportunities above what I thought I was capable of, MIT research, international clients, startup, etc.despite my age and lack of experience.\n\nBut this also prevented me from being authentic, slowed down my own learning, and from forming my own original thoughts & opinions.\n\nMy mistake was trying to use the 'fake it till you make it' strategy everywhere. Even on 'IG or Tiktok' sometimes. Leaving me with no place where I can be transparently amateur & get feedback and learn.\n\nIn summary, I think you should clearly define the place where you adopt the fake it till you make it strategy but also reserve some space where you can be transparently amateur.\n\nBeing authentic on IG and Tiktok where I get less business opportunity and authenticity is more valued makes more sense. While I'd still want to project image that I'm an expert when I'm doing business deals, interview, etc."
    },
    {
      "id": "f22c7246-9e5a-43cf-8805-ce5e892dae97",
      "title": "on social media ban and e-kyc",
      "category": "notes",
      "created_at": "2026-01-02T22:36:19.212841+00:00",
      "updated_at": "2026-01-02T22:44:39.417264+00:00",
      "content_markdown": "# on social media ban and e-kyc\n\n**in 14 days, 4 cases of school violence happened in malaysia**\n\n**the government's response?**\n\n**malaysia's considering:**\n\n- mandatory eKYC\n- raising age limits from 13 to 16\n- potentially banning smartphones for under-16s\n\n**here's why this might create more problems than it solves**\n\na thread 🧵\n\n---\n\ncontext: october 2-14, 2024 - four separate incidents of students being harmed at school [be more detail on the cases, stabbing, etc]\n\nthe pattern was horrifying. parents are terrified. the anger is justified.\n\nwhen kids are getting hurt, you want to DO something immediately. i understand that impulse\n\n---\n\nparents are backing these measures\n\nmany cite \"brain rot\" from endless scrolling, exposure to harmful content, radicalization\n\nthese are real concerns from real people watching their kids struggle\n\nthe desire to protect children is 100% legitimate\n\n---\n\nbut here's my worry:\n\nsomewhere between \"protect our children\" and actual policy implementation\n\nwe might be building something that doesn't solve the problem\n\nand creates new ones we didn't anticipate\n\n---\n\nthe theory: kids exposed to violent content online → radicalized → violence at schools\n\nthe proposed solution: verify everyone's identity with IC numbers\n\nmy question: does knowing someone's IC number stop radicalization?\n\n---\n\nit's not that age verification is a bad idea\n\nkids probably SHOULDN'T have unrestricted access to everything online\n\nthe question is: are we doing this in a way that's secure, effective, and doesn't create worse problems?\n\n---\n\nlet's talk about malaysia's data security reality:\n\ndecember 2024: 17 million ICs leaked to the dark web (still circulating) 72.5% of users have had personal data compromised multiple government sites and databases breached\n\nthis isn't ancient history, this is NOW\n\n---\n\nso when we talk about giving dozens of platforms access to IC data\n\nit's not paranoia to ask: what happens when this leaks?\n\nbecause based on track record, it's not IF, it's WHEN\n\n---\n\nand here's the thing about surveillance infrastructure:\n\nyou might trust the current government to only use it for child safety\n\nbut what about the next government? or the one after that?\n\nonce you build the tool, you can't control who uses it or how\n\n---\n\nwe've seen this pattern across asia:\n\nthailand: started with \"protect the monarchy\" → now arresting students for tweets china: started with \"financial compliance\" → now full social credit system myanmar: started with \"national security\" → 1,840+ arrests for online posts\n\nall started with legitimate concerns\n\n---\n\nmalaysia already ran this experiment with SIM card registration\n\ngoal: reduce scams and crime seemed reasonable, right?\n\nresult: scam losses UP 29%, scam calls UP 82%, created \"SIM mule\" black markets\n\nbut government got a database linking every number to an IC\n\n---\n\ni'm not saying the government is evil or had bad intentions\n\ni'm saying the solution didn't work for its stated purpose\n\nbut it DID create infrastructure that could be used for other things\n\n---\n\nlet's talk about raising the age limit from 13 to 16:\n\ni get it - kids glued to screens, missing real-world development, exposure to harmful content\n\nmany parents support this\n\nbut have we thought through the implications?\n\n---\n\nwhat 13-16 year olds can actually do on social media:\n\n• follow educational content creators on YouTube/TikTok • join study groups and learning communities on Discord • access coding tutorials and tech communities on Reddit/Twitter • find mental health support and resources • connect with mentors and professionals in fields they're interested in\n\n---\n\nwhile kids in Singapore, South Korea, Japan are:\n\nbuilding online portfolios at 14 accessing global educational communities at 15 learning from international experts creating content that opens doors\n\nmalaysian kids would be... locked out until 16?\n\n---\n\ncutting kids off from social media isn't just protection\n\nit's limiting their access to the same opportunities that changed my life\n\nto free education, global communities, mentors who actually care, opportunities that don't care about your background\n\nthat's not protection, that's putting them behind\n\n---\n\nthis isn't just about safety\n\nit's about opportunity and competitiveness\n\na 17-year-old malaysian student can't join tech Twitter to learn from developers\n\nbut a 14-year-old in Singapore can network with startup founders and engineers\n\nwho's more prepared for the future economy?\n\n---\n\nand here's the practical reality:\n\nblanket bans don't work because determined kids find workarounds\n\nVPNs, borrowed accounts, fake ICs, older siblings' phones\n\nnow they're accessing content WITHOUT parental oversight or platform accountability\n\nyou've pushed the problem underground where it's harder to monitor\n\n---\n\n**so what WOULD actually work?**\n\nhere's the thing: we don't need to wait for perfect tech solutions\n\nthere are things we can do RIGHT NOW that actually work\n\n---\n\n**1. fix what we have FIRST**\n\nbefore collecting MORE data, secure what already exists\n\nenforce PDPA with real penalties - not slap-on-wrist fines mandate instant breach notifications upgrade government cybersecurity\n\ndon't build on a broken foundation\n\n---\n\n**2. regulate platforms, not people**\n\nlook at the EU Digital Services Act\n\nrequire algorithm transparency force platforms to audit their recommendation systems remove manipulative features like rage-bait amplification hold THEM accountable for harm, not us for existing\n\n---\n\nshoutout to @altorithm by @mypocketofpink who are doing crucial research on how algorithms shape experiences and amplify harm\n\nthis is the kind of work that should inform policy, not reactive surveillance\n\ncheck them out: pocketofpink.com/#/altorithm\n\n---\n\n**3. actually invest in education**\n\ndigital literacy reduces cyberbullying and scams by 72%\n\nSEVENTY TWO PERCENT\n\nmake media literacy core curriculum teach kids to spot manipulation and scams train teachers and parents\n\neducation beats surveillance every single time\n\n---\n\n**4. strengthen school environments**\n\nthose four incidents happened AT SCHOOL\n\nmental health support, conflict resolution, early intervention programs\n\nbuilding trust so kids report problems before they escalate\n\n---\n\n**5. THEN consider privacy-preserving tech**\n\nzero-knowledge proofs (ZKP) for age verification could work\n\nplatform sees \"this user is 16+\" without getting IC, name, address, or any personal data\n\n---\n\nBUT ZKP takes time to implement properly\n\ntransparent audits, independent oversight, corruption-resistant systems\n\ndon't rush this part just to look like you're doing something\n\ndo the other stuff FIRST while building this right\n\n---\n\n**here's the clear alternative path:**\n\n✓ platform accountability for algorithmic harms ✓ investment in digital literacy and mental health\n✓ fix existing data security infrastructure ✓ smart regulation that protects without handicapping\n\nTHEN when infrastructure is ready: ✓ ZKP-based verification with independent oversight\n\n---\n\n**here's my actual take:**\n\nage verification for social media? reasonable\n\nprotecting kids from harmful content? absolutely necessary\n\nparents' concerns? 100% valid\n\nthe method matters though\n\n---\n\ntraditional eKYC with IC numbers collected by dozens of platforms?\n\nthat's maximum risk for minimum benefit\n\none breach = millions compromised, and our track record suggests breaches are inevitable\n\n---\n\nblanket age restrictions for teens?\n\nsounds good until you realize you're handicapping our youth's competitiveness\n\nand pushing determined kids toward less supervised alternatives\n\n---\n\nZKP-based age verification with strong safeguards?\n\nthis could actually work\n\nprotects kids, preserves privacy, doesn't create surveillance infrastructure\n\nbut needs proper implementation and oversight\n\n---\n\nplatform regulation + digital literacy + school support?\n\nthis addresses ROOT CAUSES instead of just symptoms\n\nrequires sustained investment but actually prevents harm\n\n---\n\nwe CAN verify age without compromising privacy\n\nwe CAN protect children without handicapping their education\n\nwe CAN address radicalization without enabling authoritarianism\n\nit just requires doing it RIGHT instead of doing it FAST\n\n---\n\ni'm not anti-government here\n\ni genuinely believe they want to protect children\n\ni just think we need to pressure them toward solutions that work\n\nwithout creating bigger problems down the line\n\n---\n\nbecause once you build surveillance infrastructure, you can't unbuild it\n\nonce you compromise millions of ICs (again), you can't uncompromise them\n\nonce you lock kids out of educational resources, you can't uncomopete the disadvantage\n\n---\n\nlet's demand:\n\n• platform accountability for algorithmic harms • investment in digital literacy and mental health • ZKP-based verification with independent oversight • smart regulation that protects without handicapping\n\n---\n\nthis is solveable\n\nbut it requires asking the hard questions now\n\nnot after we've already built something we can't take back\n\n---\n\nif you care about this:\n\nshare this thread with parents, teachers, policymakers\n\nlet's have this conversation BEFORE policy becomes permanent\n\nour voices actually matter in shaping this\n\n---\n\nmalaysia's kids deserve protection from harm\n\nAND access to opportunity\n\nAND privacy\n\nwe don't have to choose\n\nwe just have to be smart about implementation\n\n---\n\nthe infrastructure we build today shapes the society we live in tomorrow\n\nlet's make sure we're building the right thing\n\nfor the right reasons\n\nin the right way\n\n/end 🧵"
    }
  ]
}